[{"text": "dr. goldberg offers everything i look for in a general practitioner.  he's nice and easy to talk to without being patronizing; he's always on time in seeing his patients; he's affiliated with a top-notch hospital (nyu) which my parents have explained to me is very important in case something happens and you need surgery; and you can get referrals to see specialists without having to see him first.  really, what more do you need?  i'm sitting here trying to think of any complaints i have about him, but i'm really drawing a blank.", "stars": 5}, {"text": "Unfortunately, the frustration of being Dr. Goldberg's patient is a repeat of the experience I've had with so many other doctors in NYC -- good doctor, terrible staff.  It seems that his staff simply never answers the phone.  It usually takes 2 hours of repeated calling to get an answer.  Who has time for that or wants to deal with it?  I have run into this problem with many other doctors and I just don't get it.  You have office workers, you have patients with medical needs, why isn't anyone answering the phone?  It's incomprehensible and not work the aggravation.  It's with regret that I feel that I have to give Dr. Goldberg 2 stars.", "stars": 2}, {"text": "Dr. Goldberg has been my doctor for years and I like him.  I've found his office to be fairly efficient.  Today I actually got to see the doctor a few minutes early!  \n\nHe seems very engaged with his patients and his demeanor is friendly, yet authoritative.    \n\nI'm glad to have Dr. Goldberg as my doctor.", "stars": 4}, {"text": "Been going to Dr. Goldberg for over 10 years. I think I was one of his 1st patients when he started at MHMG. He's been great over the years and is really all about the big picture. It is because of him, not my now former gyn Dr. Markoff, that I found out I have fibroids. He explores all options with you and is very patient and understanding. He doesn't judge and asks all the right questions. Very thorough and wants to be kept in the loop on every aspect of your medical health and your life.", "stars": 4}, {"text": "Got a letter in the mail last week that said Dr. Goldberg is moving to Arizona to take a new position there in June.  He will be missed very much.  \n\nI think finding a new doctor in NYC that you actually like might almost be as awful as trying to find a date!", "stars": 4}, {"text": "I don't know what Dr. Goldberg was like before  moving to Arizona, but let me tell you, STAY AWAY from this doctor and this office. I was going to Dr. Johnson before he left and Goldberg took over when Johnson left. He is not a caring doctor. He is only interested in the co-pay and having you come in for medication refills every month. He will not give refills and could less about patients's financial situations. Trying to get your 90 days mail away pharmacy prescriptions through this guy is a joke. And to make matters even worse, his office staff is incompetent. 90% of the time when you call the office, they'll put you through to a voice mail, that NO ONE ever answers or returns your call. Both my adult children and husband have decided to leave this practice after experiencing such frustration. The entire office has an attitude like they are doing you a favor. Give me a break! Stay away from this doc and the practice. You deserve better and they will not be there when you really need them. I have never felt compelled to write a bad review about anyone until I met this pathetic excuse for a doctor who is all about the money.", "stars": 1}, {"text": "Top notch doctor in a top notch practice. Can't say I am surprised when I was referred to him by another doctor who I think is wonderful and because he went to one of the best medical schools in the country. \nIt is really easy to get an appointment. There is minimal wait to be seen and his bedside manner is great.", "stars": 5}, {"text": "Dr. Eric Goldberg is a fantastic doctor who has correctly diagnosed every issue that my wife and I have had. Unlike many of my past doctors, Dr. Goldberg is very accessible and we have been able to schedule appointments with him and his staff very quickly. We are happy to have him in the neighborhood and look forward to being his patients for many years to come.", "stars": 5}, {"text": "I'm writing this review to give you a heads up before you see this Doctor. The office staff and administration are very unprofessional. I left a message with multiple people regarding my bill, and no one ever called me back. I had to hound them to get an answer about my bill. \n\nSecond, and most important, make sure your insurance is going to cover Dr. Goldberg's visits and blood work. He recommended to me that I get a physical, and he knew I was a student because I told him. I got the physical done. Later, I found out my health insurance doesn't pay for preventative visits. I received an $800.00 bill for the blood work. I can't pay for my bill because I'm a student and don't have any cash flow at this current time. I can't believe the Doctor wouldn't give me a heads up to make sure my insurance would cover work that wasn't necessary and was strictly preventative. The office can't do anything to help me cover the bill. In addition, the office staff said the onus is on me to make sure my insurance covers visits. Frustrating situation!", "stars": 1}, {"text": "I love Dr. Goldberg. Best doctor I've ever had, and I've had a bunch after moving around a lot in the past 25 years. Good listener, friendly & straightforward. Always presents options and takes a \"let's try the least extreme course\" first. Office staff has improved tremendously since Dr. Johnson left. Highest recommendation.", "stars": 5}, {"text": "All the food is great here. But the best thing they have is their wings. Their wings are simply fantastic!!  The \"Wet Cajun\" are by the best & most popular.  I also like the seasoned salt wings.  Wing Night is Monday & Wednesday night, $0.75 whole wings!\n\nThe dining area is nice. Very family friendly! The bar is very nice is well.  This place is truly a Yinzer's dream!!  \"Pittsburgh Dad\" would love this place n'at!!", "stars": 5}, {"text": "We checked this place out this past Monday for their wing night. We have heard that their wings are great and decided it was finally time to check it out. Their wings are whole wings and crispy, which is a nice change of pace. I got their wet Cajun sauce and garlic butter wings. The Cajun did not have a bold enough flavor for me and their sauce is too thin. The sauce was also thin for the garlic butter, but that is more expected. They were better than average, but I don't like seeing all the sauce resting at the bottom of the boat. I would definitely come try this place out again to sample some of the other items on the menu, but this will probably not become a regular stop for wings anytime soon.", "stars": 3}, {"text": "Wing sauce is like water. Pretty much a lot of butter and some hot sauce (franks red hot maybe).  The whole wings are good size and crispy, but for $1 a wing the sauce could be better. The hot and extra hot are about the same flavor/heat.  The fish sandwich is good and is a large portion, sides are decent.", "stars": 2}, {"text": "Cold cheap beer. Good bar food. Good service. \n\nLooking for a great Pittsburgh style fish sandwich, this is the place to go. The breading is light, fish is more than plentiful and a good side of home cut fries. \n\nGood grilled chicken salads or steak.  Soup of day is homemade and lots of specials. Great place for lunch or bar snacks and beer.", "stars": 4}, {"text": "Decent range somewhat close to the city.  The mats are pretty solid; however, the grass range needs to be tended too.  It's like hitting out of US Open type rough...not very amenable to practicing.  Which kind of defeats the purpose of going to a golf range...Still gets 3 stars because the range is lit up at night which is excellent for those of us who are addicted to this amazing game, but are somewhat short on time (having a job kinda sucks sometimes, no?).", "stars": 3}, {"text": "Owning a driving range inside the city limits is like a license to print money.  I don't think I ask much out of a driving range.  Decent mats, clean balls and accessible hours.  Hell you need even less people now with the advent of the machine that doles out the balls.  This place has none of them.  It is april and there are no grass tees yet.  BTW they opened for the season this week although it has been golfing weather for a month.  The mats look like the carpet at my 107 year old aunt Irene's house.  Worn and thread bare.  Let's talk about the hours.  This place is equipped with lights yet they only sell buckets of balls until 730.  It is still light out.  Finally lets you have the pit to hit into.  When I arrived I wasn't sure if this was a driving range or an excavation site for a mastodon or a strip mining operation.  There is no grass on the range. Just mud.  Makes it a good tool to figure out how far you actually are hitting the ball.  Oh, they are cash only also.\n\nBottom line, this place sucks.  The best hope is that the owner sells it to someone that actually wants to make money and service golfers in Pittsburgh.", "stars": 1}, {"text": "This place is absolute garbage...  Half of the tees are not available, including all the grass tees.  It is cash only, and they sell the last bucket at 8, despite having lights.  And if you finish even a minute after 8, don't plan on getting a drink.  The vending machines are sold out (of course) and they sell drinks inside, but close the drawers at 8 on the dot.  There are weeds grown all over the place.  I noticed some sort of batting cage, but it looks like those are out of order as well.  Someone should buy this place and turn it into what it should be.", "stars": 1}, {"text": "Before I finally made it over to this range I heard the same thing from most people - it's just fine to go work on your swing. I had such a low expectation I was pleasantly surprised. \n\nIt's a fairly big range - if you are familiar with Scally's in Moon, it seems like it has almost as many tees, though its not nearly as nice a facility. \n\nThe guys in the pro shop were two of the friendlier guys I've come across at ranges or at courses. Yards were indeed marked and there are some targets to aim for, and even some hazards to aim away from. \n\nA big red flag to me was the extra charge ($3) to hit off the grass. I am no range expert, but this is the 4th one I've been to and the first I've seen of that sort of nickel and diming....\n\nPrice for the golf balls was reasonable and I do plan to be back every week until they close up in October for the season. Hopefully, since its for sale, it will reopen as a golf facility again.", "stars": 4}, {"text": "I drove by yesterday to get a sneak peak.  It re-opens on July 14th and I can't wait to take my kids.  The new range looks amazing.  The entire range appears to be turf, which may or many not help your game, but it looks really nice.  The tee boxes look state of the art and the club house looks like something you'll see on a newer course.  Can't wait to experience it!", "stars": 4}, {"text": "THANK YOU ROB! i truly appreciated all the help i received from this agent today who was able to removed the extra charges on my bill that the Pasadena Verizon Store on Lake was charging me on my bill for upgrading my phone.   When i went in i was having problems with my Blacberry and had to switch to the Iphone last week. Rob from the Pennsylvania store who i was connected today was able to look at my bill and all the notes and correct the problem immediately. Great Customer Service! He even set up a FOLLOW UP Phone Call with me On July 5th to make sure the credit goes through on my bill...I can't thank him enough!!!!", "stars": 5}, {"text": "After waiting for almost 30 minutes to trade in an old phone part of the buy back program, our customer service rep incorrectly processed the transaction. This led to us waiting another 30 minutes for him to correct it. Don't visit this store if you want pleasant or good service.", "stars": 2}, {"text": "I visited this store several months ago to simply ask about smartphone plans. The agent was pleasant and helpful. I would recommend a visit to this store.", "stars": 4}, {"text": "This place was DELICIOUS!!  My parents saw a recommendation to visit this place from Rick Sebak's \"25 Things I Like About Pittsburgh\" and he's usually pretty accurate.  His recommendations were to try the Reuben, Fish Sandwich and Open-Faced Steak Sandwich.  We went early afternoon for a late lunch today (a Saturday) and were seated right away.  The staff is extremely friendly.  My Mom & I each had the fish sandwich, while my Dad & Brother had a Reuben sandwich.  The fish was very good, but the Reuben was to die for!  Both dishes were massive, and could very easily be shared between two people.  On top of being extremely large portions, it was incredibly affordable.  The giant fish sandwich was $8 and the giant Reuben was $7.50.  Our drinks were always filled and we were checked on several times during the meal.  We will definitely be back!!!  Oh and a bit of advice ahead of time - they take CASH ONLY.  So come prepared, but I'm pretty sure I saw an ATM there as well.  And I do believe they are closed on Sundays & Mondays.", "stars": 5}, {"text": "Can't miss stop for the best Fish Sandwich in Pittsburgh.", "stars": 5}, {"text": "This place should have a lot more reviews - but I'm glad it doesn't, they don't need to get any busier.\n\nIts been there ages, and looks it. If you're all about ambiance, don't bother. If you pretend you're in a movie set in Pittsburgh 30 years ago it works pretty well. The service is sometimes hit or miss. Most of girls are good, one is very slow, one is amazing. They are all friendly and usually a few different people will check in to make sure that you're happy. Everything is made fresh so be prepared that nothing comes flying out of that kitchen - busy times it can take a good while to get food. \n\nThe food is AWESOME! Worth any little complaints I might think up before it gets there. Once its on the table, I forget them all.\n\n-Fish Sandwiich\n-Salmon (huge and delicious)\n-Flounder\n-Shrimp a few ways (\"Norfolk\" style is oily for my taste, and I never had it growing up in Norfolk.)\n-Hawkins St Special\n-Prime Rib (sized for two, watch it)\n\nThe prices are low, the portions are large, and just about everything on the menu  is delicious. I'm not one to pick a place because they give you a lot of food, but if you like a good value and don't want to compromise on taste, this place is a gem.", "stars": 5}, {"text": "This place was very good. I found out about Emil's when watching a show called \"25 Things I Love About Pittsburgh\" on WQED hosted by Rick Seback. This place ain't a luxurious restaurant...it's a beer & a shot bar / lounge. But the people are friendly & the food is good. I had the fish sandwich which was great. It ain't in a great part of town, Rankin, but I've been in worse places!! Try this place.", "stars": 4}, {"text": "Old school.....traditional \"mom 'n pop\" quality and perfection. The best fish and chips you'll ever enjoy and equally superb fried shrimp. A great out of the way, non-corporate, vestige of Americana. You will love it.", "stars": 5}, {"text": "Seen this restaurant on 25 best places in Pittsburgh with Rick Seback\nack. Went there with my girlfriend she grew up with the owner. She's very nice all employees are super nice service was excellent i had the fish sandwich my girlfriend had the Ruben more than you could possibly eat very reasonable prices. Going back to try the burgers  i heard there enormous and very tasty.", "stars": 5}, {"text": "Wonderful reuben.  Map shown on Yelp page is incorrect. It is actually a different Hawkins.  I'd recommend a call for directions 412-271-9911.", "stars": 4}, {"text": "Good fish sandwich.", "stars": 5}, {"text": "After a morning of Thrift Store hunting, a friend and I were thinking of lunch, and he suggested Emil's after he'd seen Chris Sebak do a bit on it and had tried it a time or two before, and I had not. He said they had a decent Reuben, but to be prepared to step back in time.\n\nWell, seeing as how I'm kind of addicted to late 40's and early 50's, and the whole Rat Pack scene, stepping back in time is a welcomed change in da burgh...as long as it doesn't involve 1979, which I can see all around me every day.\n\nAnd yet another shot at finding a decent Reuben in da burgh...well, that's like hunting the Holy Grail. So looking under one more bush certainly wouldn't hurt.\n\nSo off we go right at lunchtime in the middle of...where exactly were we? At first I thought we were lost, driving around a handful of very rather dismal looking blocks in what looked like a neighborhood that had been blighted by the building of a highway. And then...AHA! Here it is! And yep, there it was. This little unassuming building with an add-on entrance with what looked like a very old hand painted sign stating quite simply 'Emil's. \n\nWe walked in the front door, and entered another world. Another time, and another place. Oh, and any Big Burrito/Sousa foodies might as well stop reading now. I wouldn't want to see you walk in, roll your eyes and say 'Reaaaaaalllly?'\n\nThis is about as old world bar/lounge/restaurant as it gets. Plain, with a dark wood bar on one side, plain white walls with no yinzer pics, good sturdy chairs and actual white linens on the tables. This is the kind of neighborhood dive that I could see Frank and Dino pulling a few tables together for some poker, a fish sammich, and some cheap scotch. And THAT is exactly what I love.\n\nOh...but good food counts too. \n\nWe each had a Reuben, and my friend had a side of fries. The Reubens were decent, but not NY awesome. A little too thick on the bread, but overall, tasty and definitely filling. Not too skimpy on the meat. I seriously CRAVE a true, good NY Reuben, but since I can't afford to travel right now, what I find in da burgh will have to do. But as we sat and ate, burgers came out to an adjoining table. Those were some big thick burgers. A steak went past for the table behind us. That was HUGE! And when we asked about it, the waitress said 'Yeah, it's huge and really good, and he only charges $12.99 for it, ain't that nuts?' Another table of five came in, and wham. Fish sandwiches PILED with breaded fish that looked amazing. Yeah, I want that, that, that and THAT!\n\nMy friend also mentioned that they have a Chicken Parm special one day of the week that is only served UNTIL 4 pm, and that it is fantastic. If only I could GET there on that week day before 4...\n\nThe waitress did a good job, especially since there was quite a growing crowd at lunchtime on a Saturday, and only one of her. She kept up and was very friendly. \n\nThey only have Pepsi products, so I had a brewed iced tea, which was very fresh, and she did pop by to ask about refills as often as she could. As the lunch hour went on, they were getting busy.\n\nEmil's is no frills, good portions, very reasonable prices, VERY comfortable neighborhood hole in the wall...kind of like Cheers, but in a blue collar neighborhood in the 1950's. Fan-freakin-tastic! I could feel at home here.\n\nYou definitely want to hit Mapquest or plug in your GPS though. I am not sure that I could find it again on my own...it really is a hidden gem. I will be making my friend take me back until I can memorize where the heck it is.\n\nAddendum: 2nd visit for the fish sandwich. Excellent. Truly. A pound of fish on a fish-shaped bun (as opposed to da burgh's seemingly popular hamburger bun). The fish was flavorful, the batter excellent, and for just $8. This may have been the best fish sandwich I've yet to have in da burgh.", "stars": 5}, {"text": "This is a hidden gem, no really. It took us forever to find but well worth it. It is right across the street from the Rankin Police Station. The menu has a wide selection, I really couldn't decide what I wanted but I went with the ribeye sandwich. I'm glad i did too. Huge sandwich! I added mushrooms, it was very flavorful. My boyfriend got the fish sandwich, he enjoyed it as well. Fast and friendly service. Will definitely be back.", "stars": 4}, {"text": "This would be my local haunt, if I were ever to relocate to the Pittsburgh area. What a great little place! Such friendly staff, and some damn good eats!\n \nIt was so great, that we actually went there twice during our 4-day vacation to catch the Steelers/Ravens game. \n\nThey have daily sandwich specials. On Thursday night we went and had the special roast beef and cheese sand., and the .35 cent wings. Very, very tasty. I'm sorry, but this place kicks Primanti Bros. butt on the taste factor. They have about 8 different types of wings... reg., garlic, and I can't remember the rest - we got the regular, and I was wishing we would had ordered more.\n\nGoing back on a Friday night, we ordered the buffalo chicken pizza and a pepperoni n' mushroom.  Wow! That buffalo chicken pizza was awesome.\n\nThe other thing that stuck out for me was one of the customers. An older gentleman; he seemed to be a regular. I really, really wanted his SPAM t-shirt.", "stars": 4}, {"text": "A great townie bar with tasty food and an interesting clientele. I went to check this place out on the way home from the airport one Friday night and it didn't disappoint. It is refreshing to walk into a townie bar and not feel like the music stops and everyone in the place is staring at you - I'm guessing the mixed crowd of older hockey fans, young men in collared shirts, and thirtysomethings have probably seen it all during their time at this place. \n\nThe staff was top notch - the orders were somewhat overwhelming as they appeared short-staffed for the night, but my waitress tried to keep a positive attitude for my entire visit. The other waiter was wearing a hooded cardigan, and I wanted to steal it from him due to my difficulty in finding such a quality article of clothing.\n\nWe ordered a white pizza - large in size, engulfed in cheese, full of garlic flavor, flavorful hot sausage. An overall delicious pizza, aside from 2 things: 1, way too much grease (I know this comes with the territory, but still, it is sometimes unbearable); 2, CANNED MUSHROOMS - the worst thing to come out of a can. Ever. I would rather eat canned Alpo than canned mushrooms. And if the mushrooms weren't canned, they were just the worst mushrooms I've ever consumed. The mushroom debacle is enough to lower the review by an entire star - disgusting!\n\nMy advice for the place is keep everything awesome - random music from the jukebox, tasty food, great prices, good crowd and staff - and get some decent mushrooms; why they spoil an otherwise above average pie with such inferior crap, I'll never know.", "stars": 4}, {"text": "Alexion's has been around forever.  The first time I went in there, I was 19 years old on summer break from college and working at the ice cream factory up the hill.  All of the union guys from the ice cream factory went in there after work, and I immediately found out why.  MANY, MANY years later, I stopped in there with some fond memories, and once again felt welcomed and valued as a customer, even though they didn't know who I was.  THE SANDWICHES are done Pittsburgh-style, sort of like Primanti's, and they are as perfect today as they were back in ancient times when I first started visiting the place.  Alexion's is a clean and peaceful little place in the Rook Station part of Green Tree, the oldest part of the town.  I recall that some of the sandwiches I got there were ordered at a pretty late hour.  Nothing but good things to say about the place, and I wish it was closer to home!", "stars": 4}, {"text": "Good for cheap drinks and wings, they offer daily specials which is nice. \n\nDoesnt look like much from outside but the inside is friendly enough, the bartenders have been there for awhile and do a good job. Dont expect to have a HUGE selection of alcohol. \n\nTheir wings are good as are their salads. If you are gluten free this is not your place...lots of fried food and sandwiches. \nOffers a quick lunch.", "stars": 3}, {"text": "What a cool bar/restaurant.. I will no doubt be visiting again.  The service and prices were great.. and the restrooms were clean.   I had the buffalo chicken sandwich and it was delicious.  The menu consists of typical bar food food, however; theres a few different items on there which stand out on the menu..\n\nA cool bar off the beaten path that is a worth a trip.  \n\nCheers ! !", "stars": 4}, {"text": "Awesome drink specials during happy hour. Fantastic wings that are crispy and delicious, wing night on Tuesday and Thursday!", "stars": 5}, {"text": "Good beer selection. Understaffed for a light Monday night crowd, it wasn't her fault she was the only server. But it took about an hour to get our sandwiches. Mine was one of the best reubens I've ever had.", "stars": 3}, {"text": "Grew up near here. the family would always go once a month. Haven't stopped in for a few years until last Friday with a few friends to grab a drink. The sandwiches are always amazing just as I remember. The staff is amazing and friendly. Great place for lunch as well.", "stars": 5}, {"text": "Very disappointed in the customer service. We ordered Reuben's  and wanted coleslaw instead of kraut. They charged us $3.00 for the coleslaw. We will not be back . The iced tea is also terrible tasting.", "stars": 2}, {"text": "Let there be no question: Alexions owns the best cheeseburger in the region and they have now for decades. Try a burger on Italian bread. The service is flawlessly friendly, the food is amazing, and the wings? Oh the wings... but it's still about the cheeseburger. The atmosphere is inviting, but you can't eat atmosphere... so go right now. Grab the car keys... you know you're hungry for an amazing cheeseburger, maybe some wings, and a cold beer! Easily, hands down, the best bar and grill in Pittsburgh.", "stars": 5}, {"text": "The sandwiches, the wings, enough said. Alexions can best be described as a home-style Primantis before they went mega commercial. You really can't go wrong, but for my money, I would put Alexions fish sandwich up with the best I've had. That's not to take away from other selections, but if you come here I recommend not leaving until you've had either the fish sandwich, Reuben, or wings. \n\nYou'll know you're in a Pittsburgh bar when you walk in. For someone who lives in Atlanta now and only makes it to Pittsburgh a few times a year, I have to say it is refreshing. Feels like home. I haven't had a trip back without making it out to Alexions at least once.", "stars": 5}, {"text": "We met a couple of friends there on a Friday afternoon about 440 pm, based on the Yelp reviews. I've relied on Yelp in over a dozen different cities, never came away with anything less than a positive experience until today. \n\nWe ordered within 5 minutes of sitting down, there couldn't have been more than 20 people in the place, counting the people on the patio.  Took them almost 40 minutes to serve 3 sandwiches and a salad. I tried the fish sandwich, came out fried extra crispy on the ends, if there is such a thing as fish jerky a third of the sandwich would have qualified, it was just ok. I've had better at almost any church that fries fish during Lent. \n\nAll 3 of my dinner companions left partial sandwiches  or salad uneaten. Bread french fries and onion rings were good though. Iced tea was good, though I've never seen a place dispense sweet n low like they were giving away their last rock of crack. Asked for sugar but never saw any, they don't carry any other artificial sweeteners besides the pink stuff.\n\nI may give the place another try in the future for a Reuben or hamburger, assuming today was some aberration possibly due to a cook having a family emergency or something like that. Waitress was pretty good, held up under my multiple requests to find out if they caught my fish yet, hardly ever rolled her eyes :)", "stars": 3}, {"text": "Used to go there for tires, brakes, etc.  Their prices have gone way up-$400 for 4 mid-level tires for a Toyota.  Plus, 1 of the new tires went flat within 3 weeks.  Since they don\"t make appointments,  the wait to get the tire looked at was ~2 hours.  Sorry--can't wait that long to get a warranted repair,  They lost my business for good.", "stars": 1}, {"text": "I got 'new' tires from them and within two weeks got a flat. I took my car to a local mechanic to see if i could get the hole patched, but they said the reason I had a flat was because the previous patch had blown - WAIT, WHAT? I just got the tire and never needed to have it patched? This was supposed to be a new tire. \nI took the tire over to Flynn's and they told me that someone punctured my tire, then tried to patch it. So there are resentful tire slashers? I find that very unlikely. After arguing with the guy and telling him that his logic was far fetched he said he'd give me a new tire \"this time\". \nI will never go back to Flynn's b/c of the way this guy treated me and the simple fact that they gave me a used tire!", "stars": 1}, {"text": "Terrible. Preordered my tires and when I arrived they couldn't find the order anywhere. Once we got through that process I waited over 2 hours for them to be put on... I was originally told it would take 30 mins. Slow, over priced, I'll go elsewhere next time.", "stars": 1}, {"text": "Contrary to other reviews, I have zero complaints about the service or the prices. I have been getting tire service here for the past 5 years now, and compared to my experience with places like Pep Boys, these guys are experienced and know what they're doing. \nAlso, this is one place that I do not feel like I am being taken advantage of, just because of my gender. Other auto mechanics have been notorious for capitalizing on my ignorance of cars, and have sucked my bank account dry. But here, my service and road coverage has all been well explained - and let up to me to decide. \nAnd they just renovated the waiting room. It looks a lot better than it did in previous years.", "stars": 4}, {"text": "Last summer I had an appointment to get new tires and had to wait a super long time. I also went in this week for them to fix a minor problem with a tire they put on. They \"fixed\" it for free, and the very next morning I had the same issue. I called to complain, and the \"manager\" didn't even apologize!!! So frustrated. Never going back.  They seem overpriced, too.", "stars": 1}, {"text": "Most random location for a mini golf course ever.  This is old school. It's built into the woods (spray yourself for bugs first) right off Forsythe Rd near Carnegie Park.  The candy hut is fun to spend your spare change.  They recently re-carpeted the holes and added a few gimmicks that weren't there before.  It won't knock your socks off, but if you're local, give it a try!", "stars": 4}, {"text": "This quaint mini golf course is one of the oldest, yet most original and fun locations that I have yet visited.  Coming from Texas, it was nice to see a course located amongst the hilly and woody Pennsylvanian terrain. It can be frustrating that it is literally impossible to make a hole-in-one on most every hole and that the course also makes it extremely difficult to predict the direction on how the ball will follow through and bounce.  The cartoon-like outrageousness of the course proved to give laughs and a fun attempt to play.  Improvements were being made and I will look forward to returning on my next visit to the Pittsburgh area.  I enjoy traveling and visiting new courses and the only reason why I didn't give this location 5 stars is because it was impossible to intuitively shoot the ball for a best effort to beat par.", "stars": 4}, {"text": "I think this place is closed. Their number is out of service, sign is gone and the course has not been maintained. Awesome woodsy mess of a course though!", "stars": 4}, {"text": "I've been informed by a fellow Yelper that they are just closed for the season, I hope they're right! I find it strange they don't keep their phone number in service with a recording and that they didn't cover the course up to protect it from weather, vandalism, etc. Either way, I can't wait to get my game on in the spring!", "stars": 4}, {"text": "Don't waste your time.  We had two different people come to our house to give us estimates for a deck (one of them the OWNER).  Both times, we never heard from them.  Not a call, not the estimate, nothing.", "stars": 1}, {"text": "I will start by saying we have a nice new deck. That is where the good part ends.\n\nWhy two stars if we have a nice deck now? Well, it all started in May when we had a man named Al come out and talk to us about the process. He was a true salesman, I'll tell you that. Not a straight shooter, but an excited salesman that wanted to sell... And we bought into it.\n\nHe told us they were backed up with the harsh winter and a lot of jobs, but they could probably start by June 24th. Mind you, this was the end of May we met with him. He said they would have to do a survey of our land and get a permit from Dormont before they started. We felt confident in going with them, and booked it.\n\nHere's where things fell apart. Weeks went by with no word from them on the process. Finally I called and left messages. Al finally got in touch with me and the conversation was utterly confusing. He must have not understood me because he just kept talking in circles. So I hung up not knowing what was going on. Finally I called back and the admin told me that the survey could take a couple weeks to come back. I wish Al would have told us that.\n\nSo our June 24th date came and went. We finally got our survey. And they were quick to bill us for it, but no word on where we were in the process. I called back a couple times with no real answers from the admin. Apparently they were now waiting for the permit from Dormont.\n\nA month later, I was frustrated and asked to speak with someone at the company. I spoke with someone who told me that Dormont usually takes a week to process the permit, but we were now going on a month. He told me he would bug the guy about it and we finally got it. \n\nI completely understand that waiting on the permit is not their fault, but why no communication about it? Just call me and tell me they're waiting for the permit, but they'll work towards asking Dormont what the hold up is. Seems simple.\n\nFinally we get the permit and work is supposed to start. Tuesday comes and they have to wait for approval from Dormont on holes they're digging. So holes are dug and equipment is put in my backyard and then nothing happens for two days. Where did everyone go? Who knows, because I wasn't informed! \n\nI was upset and contacted the company owner, Dave, by email. I told him how frustrated I was about the lack of communication. He wrote me two sentences that  said \"there will be acres there tomorrow morning to finish and most will be done tomorrow.\" Well, that didn't happen.\n\nThen two other dudes show up two days later and did work for about three hours and left. The main guy comes back the next day and says they did it wrong. So apparently the part about how they wouldn't need access to my house changes to they're drilling bolts into my house to secure he deck. \n\nFinally, the second week into construction, my tiny 10x11 foot deck is done. It was upsetting that they left the deck dirty, and all the dirt and cement they moved around wasn't cleaned up. I even asked them to fill all the holes they dug up and didn't use, and they only filled up one. When you create a construction project, isn't it just good business to clean it up and make it look nice? Didn't happen here.\n\nMy main point is, contractors have a reputation for not being the most trustworthy. Why be that company? Why not be an upstanding company that consumers can trust? My main issues with them were that things were not communicated to me properly up front, nor was the ongoing process communicated to me. Then they left everything unfinished in my eyes, leaving the site dirty. I understand things happen and things get delayed, but just email or call me. It's not that hard to keep me updated, it is 2014 with a million ways to be contacted.\n\nEven though I have a nice deck (after I clean things up myself!), I would not recommend them to anyone.", "stars": 2}, {"text": "When I wanted a deck for the back of my home I ended up calling Quaker State Construction. It ended up working very well and they were very polite. I got an estimate and called them to start working out the details of my new deck. Once we got the plans all sorted out they started building my new deck and it was finished with in a reasonable amount of time. I now have a beautiful deck that I can relax and that my family can enjoy. Overall, they did a good job and I would use them in the future for all my deck necessities.", "stars": 4}, {"text": "I have never seen a restaurant that has a frowning brownie (a.k.a. Frownie) as their icon, mascot, or spokesperson.  King's Family Restaurant has surprised me with this.  I think it might be in direct dialogue with Eat N' Parks smiling cookie -- funny (funny odd, not funny ha-ha).  We were seated rather quickly by the manager.  Very nice people work here, I was happy to find that even though they had closed a section, the server was willing to stay longer to serve us our dinner.\n\nWe chatted with the server a little bit -- she was quite engaging -- and then moved on to order our meal:\n\nTea\nPepsi\nOpen-faced Hot Turkey Sandwich with mashed potatoes and gravy\nBuffalo Chicken strips with mashed potatoes and macaroni n' cheese\n\nOur drinks arrived and our server conversed with us some more about the area.  She would leave every couple of minutes to check on our food and to make certain that her other tables had everything they needed.  Eventually, our entrees arrived -- both piping hot.  I went straight for the macaroni and cheese.  It didn't taste bad, but I swear that it is made by Stouffers.  I didn't feel the need to eat that much knowing that there were other things to eat.  I tried the mashed potatoes and found that they too came from a package; but, again, they didn't taste bad with the brown gravy.  I moved on to the main part of my meal -- the buffalo chicken strips.  At least they were all white meat and the buffalo sauce was more than just mild.  I contented myself with eating them.  \n\nI tried some of the hot turkey sandwich and just left the rest for my friend since it was not fresh cut turkey but instead luncheon meat that had been heated.  I finished off my dinner and was happy in the end.  No, it wasn't the best food in the world, but the service greatly helped the perception and it didn't taste bad.", "stars": 3}, {"text": "So... back in the late 90s, there used to be this super-kick-ass cinnamon ice cream, like an apple pie ice cream without the apples or the pie crust.  SO DELICIOUS!\n\nHowever, NOW there is some shit-tastic replacement that tastes like vanilla ice cream with last year's red-hot in the middle: totally gross.  Fortunately, our server was nice enough to warn me about the change and bring me a sample, so I only had to suffer the death of a childhood memory rather than also having to pay for it.\n\nThe portions are big and filling, just don't come for the ice cream.", "stars": 3}, {"text": "Ive pretty much been eating at various Kings' pretty regularly since I was a child when my parents would take my sister and I into the Fox Chapel location often.  Lately me and my girl have been visiting the Heidelburg location. I love the food, it really tastes homemade, much like something a grandmother would make, complete with gobs of butter and side dishes. Prices are low, selection is great, but dont expect fine dining by any means. \n\nService is hit or miss at pretty much all of them; if you have lunch at any Kings, you will likely be waited on by a sweet but sarcastic  older lady who has been doing the waiting thing for 30 years and knows her game. Seek out this lady.  My experience with the younger crowd at night isnt the same.\n\nIm in my 30s now, and very little has changed, other than the Fox Chapel location was remodeled about 10 years ago to look less like a diner, which was a big fail.  Any girl I meet has to enjoy Kings or she's out.", "stars": 4}, {"text": "Hoofah.", "stars": 2}, {"text": "I heart King's. I've always been a fan and this one was as good as my old one in Monaca.", "stars": 4}, {"text": "I arrived around 10 am on a Saturday morning.  I was greeted by the hostess,who was polite and friendly, and I informed her that I was alone.  She had just arrived, as well, and wasn't exactly sure what was going on yet, so she asked (the manager?) where she should seat me.  After receiving guidance, she brought me to a table towards the back.  It had not yet been cleaned after the previous guests had dined.  So, she quickly got it cleared off, grabbed a rag, and wiped it down.\n\nThe waitress came rather quickly to take my drink order.  She was extremely friendly.  I ordered coffee and water, which she went and got while I looked over the menu.  She returned, and took my order.  I ordered the Cinnamon Swirl French Toast Special - Three slices of French toast made with Pittsburgh's own Jenny Lee® Cinnamon Swirl, two farm-fresh eggs, with bacon or sausage (I chose sausage), and your choice of potato (I went with the cheesy hash brown casserole).  I also added an orange juice.  She went and put my order in, while I waited, and came back with it after not too long.   The eggs were cooked exactly how I wanted them, the cheesy hash brown casserole and the french toast were both delicious.  I also enjoyed the sausage which was pretty typical.\n\nKings Family Restaurant featured a very friendly staff, great prices, and tasty food.  I am pleased and will definitely come back again.", "stars": 4}, {"text": "thisis not the closest Kings to us, but we often will travel the extra miles because the service and food at this location is always the best.", "stars": 5}, {"text": "Average run of the mill store.  Associates are young teens and they really don't know where anything is.  Luckily I am able to get around to find everything.  Found my puppy treats and moved on.", "stars": 2}, {"text": "Not bad for a Shop N Save, most are privately owned, so availability of items might differ from place to place. The only time I frequent S n S is when the have their huge two day sales usually held on Thursday and Friday at least once month.\n\nGood bakery at this location too.", "stars": 3}, {"text": "Two meals, on the recommendation of a friend who lives near the place, and after the second trip, I was compelled to write. 'Rocky' would definitely describe the experiences.\n\nOn the first trip, I went to try their (at that time)raved about Reuben. And YET to find a true good Reuben in da burgh, I tried it.\n\nWell, they were out of the proper bread, and the guy had to run to the store to buy the closest thing he could find, which was not the proper bread, and instead of one of their 'raved about' Reubens, I received two mini-Reubens, which basically took the guts from one Reuben, and spread it out onto two sandwiches on regular sized bread. I ate it. It wasn't great, but they swore it was because they'd run out of the bread. Bread or not, it still wasn't great. The atmosphere was pleasant in that 'blue collar bar' kind of way, and the staff was very nice, but not a winning pitch on the Reuben.\n\nThe second trip was after a long day of moving furniture with the same friend. Sat in the back room, instead of the bar, which felt more like a restaurant, of course, with the big screen TV covering the sports of the moment.\n\nI was in the mood for dinner this time, and after a scan, decided on fried chicken and mashed potatoes with the salad bar. My friend ordered one of her faves, the breaded pork chops.\n\nWe hit the salad bar, which was uber-basic. Three soups (mostly vegetable loaded, which left me out), basic iceberg lettuce mix (very probably out of a bag), a few veggie toppings, and three or four dressings. It was a basic salad, no big deal. More or less an appetizer filler before the meal.\n\nThe mind-blower in this trip was the ordering of the fried chicken dinner. Our waiter looked like a 19 year old gas station attendant, skinny little blonde guy with a sweet but incredibly naive face, and an air of vapidity, which was confirmed when I placed my order. I asked what chicken pieces came in the dinner, and asked if it was possible to only get dark meat. I never imagined how confusing a question that could possibly be. It literally took him two trips back to the kitchen to 'ask', and the child honestly had no clue what 'white meat' and 'dark meat' meant. The first answer he came back with was that the chicken came in a pre-portioned prepared bag, kind of Kentucky Fried Chicken style...which didn't answer my question, thus prompting the second trip. \n\nAfter the second trip back I heard the cook holler 'Tell him I'll fix him up'. \n\nWell, the chicken was prepackaged dreck like you'd find in the freezer case of Walmart, tiny and not good, and the potatoes had that slight tinge of chem-spuds flavor, laden with some kind of chopped up green (parsley?), and a side of that basic brown gravy served up in 5 gallon buckets.\n\nThank goodness for the basic salad bar.\n\nEven my friend admitted that her pork chops were different and not what she'd expected. They also appeared to be from a freezer bag.\n\nThe irony was that the boy who didn't know white meat from dark meat, was chatting with some other customers...about baseball...and he was a genius about the mindless sport of baseball. Ahhhh da burgh.\n\nThird base? Nah...why bother when there are so many other options around. Go on in a grab a beer and chat black and gold if you happen to be in Carnegie...they can help you out all types of ways in that area. Just don't go hungry if you actually have tastebuds.\n\nFrom what I understand it 'used to be' really good homecooked food. But apparently, mama has left the kitchen.", "stars": 2}, {"text": "everything was great!", "stars": 5}, {"text": "If you are searching for a go to fish place for Lent....look no further.  This place will give you the best fish sandwich in Pittsburgh.  The sandwich has enough fish to make four sandwiches.  You will not be able to finish this sandwich in one seating.\nEnjoy....", "stars": 5}, {"text": "Rocky's has been in business since the 1980s and still going strong.  Their food is good.  Not haute cuisine, pretentious!  Everyday, well prepared and taste bud pleasing home style cooking.  I've mostly gone during supper hours and  and ate in the dining room, but, today I introduced an old friend to \"linner\" in the bar.\nHe ordered the large version of fish sandwich.  Rocky's is famous for their fish.  Three large breaded and fried fish filets, bun and fries for under $10.  Needless to say, he had no complaints and brought home more than he ate.\nI ordered the meatball grill.  It was delish.  Served on thick cut Italian bread and made \"grilled cheese\" (mozzarella) style.  Meatballs and tomato sauce are both good!  Also, served with fries.  I brought home half the sandwich.\nAnother good meal there.  Friends, mother, and former boss all enjoy their food!", "stars": 4}, {"text": "Italian dinners, American, endless soup and salad bar is great. Most food for your dollar. I highly recommend. Great bar. Good place to watch a game. The bar can get quite noisy in the evenings, but it adds to the great atmosphere at Rocky's", "stars": 5}, {"text": "If you want a true understanding of Pittsburgh in the morning, come here. This greasy spoon is always packed, and is one of the better of its kind south of the city.\n\nThey serve waffles in halves, which is great. The eggs and toast are good, the homemade hot sausage is excellent. The drawback are the barely cooked potatoes.\n\nIf you're hungry, get \"The Mixed Grill\"... Gab and Eat's brand of the \"kitchen sink\" breakfast that all Midwest places are about.", "stars": 3}, {"text": "Good Luck getting a seat, that's all I have to say. The Gab and Eat is famous and infamous. Diner food is what's up and I like it. When I was a roofing mechanic, we'd meet there before work. Although I'm not sure I would recommend it if you're working were there's no bathrooms. hehe", "stars": 4}, {"text": "Stick to basics and this is the best place in or around the 'burgh.  First time go with a friend and sit at the counter.  Short order cooking at it's best, it's like a floor show with the actor's backs to you.  Breakfast has no losers.  Eggs, omelets, pancakes, waffles, breakfast sandwiches to order, the ever popular mixed grill, get a 1/2 Louie instead of home fries (although they good as is) and don't forget the italian toast.\n\nFrequently voted the best burger in Pittsburgh for a reason.  As for ambiance, well lets just say I don't think there are two matching plates or coffee mugs in the joint.  But the coffee's good and hot and refreshed often as the service is good, andlocal with many long time folks working here.  If I don't get there for awhile I need to go through detox because I feel too healthy.", "stars": 5}, {"text": "The biggest breakfast in Pittsburgh, as far as I can tell - and delicious and cheap too. I ordered some mix of eggs, bacon and pancakes - and got 2 dinner-sized plates, one loaded with pancakes and the other stuffed with eggs, bacon, and home fries. Oh, and a side of toast. For under $5, if I recall.\n\nHUGE portions, all well-executed; as good as DeLuca's.\n\nI've not had anything besides breakfast, so can't comment on the burger or anything else.\n\nCramped quarters, and you'll have to wait, but when nothing but monster morning food will do, this is the destination.", "stars": 4}, {"text": "Cheap, unpretentious, and, for this, one of my favorite breakfast joints in the country.  Simply put I LOVE it here.  The mixed grill, the sausage and egg on a biscuit, the home fries.  This it the very definition of diner.  Thank you Gab 'n' Eat!", "stars": 5}, {"text": "Okay, let's first set expectations.  This place is a true DIVE...this is not for the NYC foodie crowd.  If you want a down home, large portion awesome breakfast, this is the place.  The place is packed with happy diners, the server was very friendly in a busy grandma kind of way.  The best part - they have \"dippy\" eggs on the menu and define the degree of dippy you can order.  For anyone who has never heard of a \"dippy\" egg - this means sunny side up or over medium where the eggs are still runny and you can dip your bread in them.  The eggs were great - I ordered mine over medium, the breakfast potatoes were fab - no complicated additives like peppers or onions - just plain good potatoes cooked in fat - the best part - the fresh Italian bread.  YUM!!!", "stars": 5}, {"text": "I miss this place. When I return home to pittsburgh this is always a must to ease myself into a saturday morning recovery after getting banged up on cheap south side cocktails the night before. When I think of pittsburgh, I remember cutting morning classes in highschool just to get after the best bacon egg and cheese i know of. Honestly i live in nyc where you can get a bacon egg and cheese on every single corner, and nowhere that i have been does it as well as this joint. Go here and you will be happy you did.", "stars": 4}, {"text": "I've lived in Pittsburgh for 6 years, and in Carnegie for over 2 years, and by far, this is the best greasy spoon joint I've found. If you can stomach the wait (no reservations, naturally), you'll enjoy overflowing plates of goodness, thanks to the well-seasoned griddle where all of the food is made. \n\nHere are the highlights:\n\n-Cheap: Breakfast for two can be well under $10, with lunch around the same.\n-Crowded: Get there early and expect to wait. They close pretty early on the weekends too (oddly, at 12:45pm)\n-Cash only\n-Huge portions: When ordering fries or homefries, always get the half order, unless you're a lumberjack\n-About those homefries: They're often undercooked. I've had better, believe me. My favorite things to eat in life are potato products.\n-My favorite item: hot sausage sandwich on thick Italian toast, with cheese, lettuce, tomato and mayo", "stars": 5}, {"text": "Love this place.  Never had a bad meal.  Good portions and great people.  Be ready to stand in line.", "stars": 5}, {"text": "My favorite breakfast place.  Have good sandwiches also.  Stopped again for Bfast and had the mixed grill--get the small portion unless you are a real MAN!  Mixed grill has sausage, (could it be Ricci's?), eggs, onions, and home fries, soooo goooooooood!  Use Mancini's bread for toast, got the raisin toast - Yum.  \n\nHave had many other items and just love the food.  If you like to watch a true cook, sit at the counter.  Banter with the cook and staff and patrons is fun!\n\nLunch is good, sausage sandwich, hamburgers and other lunch meats fried on the grill.\n\nGets busy for Bfast so you may have to wait.\n\nRemember it is a diner.  Don't expect fancy decor.", "stars": 5}, {"text": "Definitely a greasy spoon! Always packed here and always a wait but worth it. The omelets are really tastey especially with their homemade sausage. I also like the mixed grill.  My parents love their burgers. Took off a star for lumpy booths and really tight tables (your arm gets hit when someone walks past) oh and waitresses aren't very attentive.", "stars": 4}, {"text": "If you're looking for no frills but a great breakfast this is the place. I got the mixed grill half portion and was very full. Make sure you have extra calories for the day because they are not afraid to use butter. Loved the breakfast and would go back. Not much room for sitting down but worth the wait.", "stars": 4}, {"text": "Great homemade hot breakfast sausage and a wonderful family restaurant feel. \n\nReminds me of the one my parents used to own in Mi. \n\nHave fun finding a table on the weekend :)", "stars": 4}, {"text": "Great breakfast place. Come hungry. Look for Dick, my dad, and Gino at the counter every a.m. about 0830 and say hi. Try the mixed grill (half).", "stars": 5}, {"text": "OK, what is with all of these \"CASH ONLY\" places in Pittsburgh? I can appreciate that some smaller businesses might have trouble installing a credit card system in their store/resturant, but could you perhaps provide an ATM?  In the past, this would deter me from eating at this place. \n\nLooking at a standard breakfast menu, I decided to go with a tuna melt instead. What I got was a cold tuna salad sandwich with a slice of cheese on toast. I had ordered a melt being in the mood for a warm meal, but to no avail. One day later I can't even remember what my side was. I suppose it didn't leave much of an impression on me.  I have to say that the dessert was really good! The cherry pecan pie! I have not seen this concoction anywhere else but this was awesome! The cherries were not the sweet canned variety, but a pie worthy tart topped with sugar. I think I want to make this pie with my parents next harvest of our cherry tree!\n\nMy first impression is \"Eh.\"  I am learning how crazy Pittsburghers are over breakfast! Seriously, waiting 30 minutes for a table at a tiny diner with a menu that reads as follows:  \n\n\"2 eggs and toast $x.xx\"\n\"2 eggs, meat, and toast $x.xx\"\n\"2 eggs and pancake $x.xx\"\n\nI'd rather go to a Denny's and order the \"create your own Grand Slam!\"", "stars": 3}, {"text": "BEST DINER IN THE COUNRTY!!! We've been to many famous diners across the country and we still give  Gab and Eat the best rating !! I was a little intimidated when I first walked in and there was like 2 pounds of butter just sitting on top of the homefires on the grill.  If you are looking for a healthy breakfast they probably can accomodate you, but Everything I ate was clearly the opposite of healthy.  After trying like every meal they have I would recommend the mix grill(half unless you are sharing) adding cajun seasoning with the texas toast.  Burgers are great too.\n\nIt's hard to find a place that makes a better breakfast than you could make by yourself at home, but this place does it.  The atmosphere is classy, old school Americana.", "stars": 5}, {"text": "Best French toast ever!! Love the friendly atmosphere, and especially the breakfast. Never been disappointed. You have to try French toast with raisin bread too... yummy!", "stars": 5}, {"text": "Great Diner!  Their breakfast is the best in the area!  Lots of  choices and always good.  Love the unique mugs they use for coffee and all the writing on the wall.  Get there early otherwise you will not get a seat!  They have homemade hot/sweet sausage and texas toast.", "stars": 5}, {"text": "Readers of my reviews may recall that I once referred to The Dor-Stop as possibly the best breakfast in Pittsburgh.  Well, faithful followers, I must now admit that The Dor-Stop has now been verified as only one of the best.  Why?  That's because Gab and Eat I have now found to be THE best breakfast I've ever had.  If it was closer to my home I would quickly become a regular.\n\nI easily decided to order the Mixed Grill (Half).  Before I go on, I must ask...has anyone seen a full order?  Because I honestly can't imagine how much food that is.  I created my own with bacon, cheese, eggs and potatoes.  Based on reviews I also opted to get a side of the sausage and was pleased as punch when our waitress asked if I wanted hot or sweet....or one of each.  I like variety, so I jumped on the change to try both.  I also selected the Italian toast - what other kind is there, really?  \n\nWhen my food arrived, it looked delicious.  There was so much bacon that after eating half of my Mixed Grill it looked like I'd barely started.  The sausage was great, just don't ask me which one I liked best.  My toast?  4 thick slices that looked to be about half the loaf and were buttered on both sides. It was a struggle, but I was determined to enjoy every tasty morsel and not leave a crumb.   \n\nIn case anyone is wondering, yes, they use real butter.  I saw pounds of it stacked in the kitchen with my own two eyes.  The wait staff was quick and efficient as well as helpful and friendly with our larger group of 9 people.  The fact that none of the plates match and I noticed a sign at the front register that said, \"We need mugs\" just makes me love this place even more.\n\nA few tips: 1.) Order the Mixed Grill.  2.) Cash only!  3.) Gab and Eat is a popular place but also very small and narrow (or cozy if you will).  I recommend going during the week when they are still busy but can accomodate a group.  That way you won't feel rushed or crowded.  4.) Get to Gab and Eat ASAP!  You'll be glad you did!", "stars": 5}, {"text": "Classic breakfast joint.  Grimy looking hole in the wall located on one end of a seedy looking strip mall.  Window is opaque due to the grease so you can't hardly see inside. On the outside, there are about a dozen people waiting to get in.  When you finally do get inside, you see that there are 15 tables and a counter, all occupied by people from all walks of life.\n\nWhat's the attraction behind this flea hole?  The FOOD!  Lots of it and dirt cheap.  I sat at a vacant stool behind the formica counter and ordered the mixed grill.  Potatoes, eggs, sausage, bacon and Italian toast.  A giant mound of food guaranteed to sooth any hangover.  I swear the full mixed grill had two pounds of food.  Neat thing is that the grill is right in front of you so you can see your potatoes and eggs frying in a pool of fresh grease.  All that food, plus coffee and tip for around ten bucks.  Cash only, so put that plastic away.\n\nOnly bad thing that could happen is some douche bag from the Food Network or Travel Channel will make this place famous, and then I'll never be able to get in.", "stars": 5}, {"text": "Yum - freaking - me!\n\nAs the other fellower yelpers mentioned - this place is a cash only.    A couple of recommendations:\n\n- Don't eat early in the week \n- I don't recommend wearing any tight clothing (no skinny jeans) - you will not be skinny when you leave\n\n\n I walked in for breakfast one early weekday AM.   The place was packed with locals and regulars.    A very good sign.\n\nMy co-worker recommended I get the mixed grill.   I ordered the large mix grill.   My waitress tried to warn me - it is large (very large).    I ended up eating the left-overs for the next 2 days.\n\nFood - \n\nThe Mixed Grill comprises their homemade sausage, grilled onions, grilled peppers, potatoes, fried eggs.     \n\nPortion -\n\nThis should have been a man vs food episode.   I was not going to attempt to eat all the food.   It was really good.\n\nService - \n\nMy waitress looks as if she had been working there for years.   She was fast, friendly, and offered good advice.\n\nPrice - \n\nThe cost ranges $5 - 10.\n\n\nI will definitely go back after I buy some new stretchy pants.", "stars": 4}, {"text": "Best breakfast spot in the area, If you like diner food it is the place to go. Small, so you will want to avoid the church crowd on Sundays, but the wait is never too long.  Everyone is friendly and has obviously been working there for a while.  If you are feeling like lunch food go a little later, their burgers are made on the breakfast griddle and are delicious.", "stars": 5}, {"text": "Great breakfast, good price. You might have to stand outside in line though, so I don't really recommend winter time to go. lol. Very friendly service, interesting coffee mugs. They have great deserts and such also. Bring your cash though as they dont' take cards.", "stars": 4}, {"text": "I always love a good diner.  Gab and Eat was just what we were looking for on a Saturday morning.  Good food.  Great people. Pittsburgh ambiance. \n\nThis place is obviously a beloved neighborhood gem.  I had french toast and bacon.  The french toast was made with the best Italian bread.  My fiance had what they called a 'mixed grill.\"  It consisted of eggs, peppers, onions and home made sausage.  Not something you would eat everyday, but he loved it!   They also had great coffee.  They actually ground up the beans in front of us.  Now that's fresh.\n\nWe want to return sometime for \"turkey day.\"  Apparently they made fresh turkey every Tuesday.  Now that sounds good!\n\nCan't wait to return.", "stars": 5}, {"text": "This is exactly what a breakfast place should be like--comfortable, quirky, unpretentious and with inexpensive, large portioned working class breakfast plates.", "stars": 5}, {"text": "On our current road trip of baseball, brews, hockey and diners, we decided to try Gab & Eat based on yelpers rating putting it #1 for breakfast in Pittsburgh area. We have to agree with most other reviewers that this is a place to eat.\nWe arrived around noon on Saturday and were happy there were a couple open tables. The place is tucked at the end of a strip mall and you have to look to find it. There is plenty of parking.\nInside the decor is quaint and funky at the same time. Country style decorations and signs are mixed with nostalgia signs & posters. Most interesting are all the signatures and comments written on the wall by past customers. We regretted not having a marker to add ours. The other highlight was three large white boards with trivia questions - fun way to spend time waiting for food.\nThe waitstaff there is...uh, experienced. They are attentive, pleasant and efficient.\nAfter reading reviews I had to try the Mixed Grill. But S went with pancakes with a side of bacon. The pancakes were outstanding...maybe the best either of us has eaten. They were thick but with light texture and rich flavor. \nHis bacon was cooked just as requested - as crisp as possible - and very flavorful.\nThe Mixed Grill is a mixed together concoction of eggs, potatoes, onions, peppers, cheese, and spicy Italian sausage grilled together. I'm glad I heeded those who stressed going with the half size order. It filled a full sized dinner plate with a heaping order. I couldn't finish it all and that's rare. How do they serve the whole potion -- in a trough?\nEverything was cooked well. The sausage added a nice bite to offset the somewhat plain potatoes. You can build your own mix but the basic was a good mix.\nMy only complaint was the amount of potato and that they are pretty plain. I like home fries with lots of seasoning that have aged on the grill. These potatoes were pretty uniform chunks with little seasoning. Personal preference.\nIt usually comes with Italian toast but they were out so I went with raisin. It was delicious soft inch thick slices.\nCoffee was excellent and the cup stayed full. The total was less than $15. Fabulous value for the quality and portions.\nWhile I can't say it's the best breakfast in Pittsburgh (only here 3 days), its the best so far and one of the best we've had.", "stars": 5}, {"text": "Met my nephew for lunch in Carnegie and he suggested Gab & Eat.   Way to go Justin!  The restaurant is in a strip mall across from the Dairy Queen.  The grill is right up front so you can see them cooking.   They have counter space for eating and tables/booths for 4.   Don't expect to sit at one table if you have more than 4. They have a great looking breakfast menu.   We all got burgers of varying kinds!  They were tasty!   The buns were buttered, toasted and soft.  Yum!   the amount of butter didnt bother me  but it did my whiny mother. Who whined even though there is a no whining sign as you walk in the door.   We ordered fresh cut fries as onion rings.  Both of which were great.  The half order was plenty and a nice option to a full order.   The restaurant was full of local men at lunch which is usually a good sign.  I give it a 4 star only because of the waitress who kind of threw straws, silverware and napkins at us as she walked behind the counter.  At least she didn't throw the food when it came!   She also served the fries and Onion rings way before our burgers came out which was kind of weird.   They were nice and hot but would have been cold had we waited for the burgers.   It didn't factor into my four star rating but I deduct a star from nephew because he invited us out to lunch then allowed me pay!   Just kidding Justin!   Love ya!", "stars": 4}, {"text": "This is a perfect example of what a breakfast diner can be: excellent breakfasts in huge portions for cheap. I had the western omlet and will be getting it or another omlet again soon\n\nThe coffee was good, totally serviceable diner coffee. The waitress was wonderfully friendly and hopping around from table to table. The food was excellent. The ambience was exactly right for a diner. It was packed. The wait was not nearly as long as I was expecting. 10 minutes maybe.\n\nTotally recommended. Come hungry.", "stars": 5}, {"text": "Wow! Read the great reviews and I was not let down. Huge portions. The mixed grill was THE best breakfast I've ever had. If you go to Pittsburgh it is a must eat. Service was superb. Friendly staff. Led zeppelin on the walls. .....what else could you ask for?", "stars": 5}, {"text": "I have been coming to Gab n Eat for almost 20 years and They have never let me down. I get a typical breakfast if eggs, ham, toast, and home fries. Delicious as usual. The ambience however is usually lacking. The walls are dark, with writing and signatures of semi famous people all over the place. Pictures of local people hang on the walls(i secretly want mine up there) along with posters galore. While its fun to look at the first 10 times, it gets a little boring after awhile. So today when I arrived I expected the same old experience. Wow was I wrong! As soon as I looked at the door I knew something was different. The place seemed lighter and brighter. To my pleasant surprise, they painted and got new counter tops!! They're not quite done yet but the place has a new Happy vibe to it. The awesome breakfast, the new decor and the 5 guys sitting at the counter making me laugh are why I will be back( maybe for lunch).", "stars": 5}, {"text": "A gem. The coffee cups are mismatched . The owner is three feet away from me cooking. The sausage is made for them locally. And the food is frickin awesome. I had the pancakes, my daughter had the sausage and egg sandwich.  Cash only.  Friendly service.", "stars": 5}, {"text": "Excellent breakfast and lunch menu. Friendly staff and super food. Modest environment with excellent food. Worth the wait.. dont miss this one. \nBest breakfast and lunch food in the Pgh South Hills hands down.", "stars": 5}, {"text": "What a find! I stopped in here for breakfast while in town for business. The service is so friendly I thought I was down south. The service was quick, frankly and felt like I was with family. \nFantastic poached eggs, Cajun homefries and crispy bacon. Gab and Eat is definitely a place I world recommend to locals. I was stuffed and the bill was only $8.00.", "stars": 5}, {"text": "A fine breakfast joint. You gotta love the small diners. Highly recommended.", "stars": 5}, {"text": "Barb's Country Junction gets a 5 star rating for me because it is truly everything that a Pittsburgh restaurant should be.  In addition to being the apple of my nostalgia's eye, it is also the constant thought of my tummy when I'm hungry on the weekends.  \n\nBarb's breakfasts cannot be beat, but truly any meal you get there you won't regret.  Everything is made to order, with fair portions, and great prices. My recommendation is a breakfast sandwich on a bagel and a coffee.  There's nothing better than drinking from a cup that could have come from your grandma's kitchen.\n\nI know that Gab N Eat is nearby, and Barb's can be a little weird get to with the strange traffic pattern but this really is a gem of Carnegie that you've gotta try!", "stars": 5}, {"text": "Great little place. Treats you like a local.Eaten here 3 times a week for a month.  Same overtime. Barb is always here.", "stars": 5}, {"text": "This is a great place to eat and everyone is so friendly. I live right down the street from here but unfortunately, I have only gone a once. Trust me, I will go here more often. The food is great, prices are low, and the staff are friendly. My cousin and I wanted a place to eat and catch up and this was perfect place. I will go here more often.", "stars": 5}, {"text": "My first time going to Barb's Country Junction and I really wanted to like this place, I really did...however, I didn't.\n\nThe food was decent, some was above average and some below but it was overall decent. I got pancakes, bacon and eggs. The pancakes were really good and fluffy, the home fries were simply okay and the eggs were not cooked well. My son had a burger and it was good. The coffee at this place was brewed to perfection which a appreciate. I would give the food 3/5.\n\nThe service was subpar for sure. While our waitress was a really nice girl, she wasn't on top of anything at all. Had to ask for coffee refills, had to ask for silverware, for napkins...etc. She got the order messed up and so on. I give the service 2/5.\n\nThe inside of the place had some country charm as you'd expect but want particularly cleanly. It also had a leaky roof in several places which had buckets collecting the water. A customer even tripped over the buckets and fell. I give the interior 2/5.\n\nThe prices were decent. I fed my whole family breakfast (3 of us) for $23. I give the prices 3/5.\n\nSo in summary, you can get okay food here for a rather cheap price but it is not a great place to dine in by any means. There are better diners in the area that I will patronize in the future rather than Barb's.", "stars": 2}, {"text": "My husband and I tried this place for the first time today. It was easy to find and no problems with parking. It's \"Seat Yourself\", but there were no signs stating this, so we stood there looking like fools for a minute. It took awhile for the waitress to acknowledge us and I'm guessing that this was Barb. She apologized and said that one of her workers called off today. No big deal and her apology was appreciated. She came back with our drinks, dropped them off, and left again. We didn't see her for another 20 minutes. Ultimately, we were there for 30 minutes before she took our order. This was aggravating to me. I don't mind waiting for my food if I know it's going to be awesome and they're making it with love, but come on now. We ordered the hot pepper omelette/home fries/ toast and chocolate chip pancakes/sausage. The food was alright, really nothing special. A new waitress ended up taking care of us and she was much more attentive. We may or may not go back.", "stars": 3}, {"text": "For the price I ended up paying, this place was fine. There was a full kitchen, king bed and TV. I was just surprised at the lack of amenities at the hotel. While I have stayed at other extended stay hotels, I was surprised to find a sign in the room at this one stating that you only got your room cleaned once per week...if you wanted it more often than that you would have to pay for it. If you needed fresh towels, you'd have to go to the main desk to get them. They also only provided a small bar of soap in the room...not the typical soap, shampoo, lotion, etc. This didn't bother me too much as I was only staying a couple days but again I found it surprising not to have these basic things. \n\nThe hotel in general was easy to get to and very easy to get back onto to freeway from. The hotel was clean and the people who worked there were very nice.", "stars": 3}, {"text": "Great value, close drive to city, not much to do around hotel, its a business park. Carnegie city has a few bars and restaurants.", "stars": 4}, {"text": "Simple\nRustic\nLocal\nWait that is every Gordon Ramsey review\n\nMy experience at extended Stay America was great. The staff was warm and friendly and made it a point to speak to me every morning as I left and when I returned in the evening. They went out of their way to provide A confirmation and point me in the direction of restaurants and nightspots when needed. \n\nIf I ever need to utilize an extended stay hotel I wouldn't hesitate to head back there.", "stars": 4}, {"text": "I've stayed at a couple of Extended Stay sites that I found quite satisfactory and this location proved to be just as good. Excellent place to stay while visiting Pittsburgh. It is just a five minute drive to downtown. Location is in a business park area so it is quiet. \n\nThe rooms contain a nice kitchenette area with a full sized refrigerator, sink, cabinets and two burners. There is no oven which I expected as the descriptions all state \"full kitchen\" so be aware of that. Also they do not keep the dishes, pots and pans, coffee makers, toasters or utensils in the rooms. If you want them you have to request them at the desk during check in. \n\nThe room was clean and well maintained. Cable tv quality is spotty sometimes but not intolerable. The free wifi is usually fast. \n\nThe best part about this location was the staff. The people at the desk were all very pleasant and welcoming and quite willing to assist with any questions or issues with a smile.  I would definitely stay at this location again and highly recommend it.", "stars": 4}, {"text": "Tonya is super sweet and the front desk people are very helpful", "stars": 5}, {"text": "I have said it on other sites and will repeat here. You MUST try their burgers. They are juicy and delicious with a bun that is perfect. Another must are the fries with Guinness gravy and if you haven't had enough go for the ultimate sleeper, Leek and potato soup. Authentic black & tans. Harp and Murphys on tap. It don't get no better. This is a true gem my friends.", "stars": 5}, {"text": "Be warned. Don't expect the best service ever. It's not the cleanest place you've been in either. The decor is soccer jerseys from places and teams you've probably never heard of. It's divey, eclectic, and authentic. \n\nIf you're looking for good Irish food and a cold pint, you can't go wrong at the Pour House. Like most of Carnegie's Main St, this is a hidden gem worth seeking out. They have some of the best Irish food I've had in Pittsburgh- the colcannon is awesome and the shepherd's pie is out of this world. If you're not looking for Irish food, then try the grilled cheese- and make sure you ask it with the three cheeses together. It's big and the cheese is thick and gooey. I get it with a side of potato pancakes... Yum. \n\nAlso, they have Guinness, Smithwicks and Harp on tap...", "stars": 4}, {"text": "If I could give this place less than one star, I would. I have no idea who gave this place high reviews but they must either own the place or be time travelers from back in the day when this place might not have sucked. The decor is tired and grimy, the place reeked of smoke, and the bartender/server was surly, to put it mildly. We went there on a Saturday night with a mind to try the Irish food. Apparently, we were out of luck. I've always thought that the secrets of restaurant success is to actually stock food for people to eat. He told us before we ordered that they had no \"pies\". No chicken pot pie, no shepherds pie, etc. So, we gamely tried to order other things. We placed our order. My wife, for example, ordered the Irish stew and he came back 5 min later telling us they were out of that and even more things for several people in our party. At that point my wife picked out a third option, ham and cabbage, only to be told again that \"they were out\". At that point, realizing that the only food to be had in the place was what was crusted on the menus, we asked to pay for our drinks and left. They actually then gave us flack for not having enough to put it on a debit card. In short, unless you like your dinner with a side of disappointment and depression, I'd probably avoid this place like the plague. Speaking of the plague, I suppose we should thank Mr. Surly for inspiring us to walk out. I only have two bathrooms at my house and would've been hard pressed to accommodate several violently ill people at once.", "stars": 1}, {"text": "Best Irish food in the Burgh.  Great bar food too.  The service is maybe a bit surly and it's not the cleanest, nor the best decor.  But, that's not what this place is about.  It's a town Irish bar and it serves great solid Irish fare and suds to the locals.  And it does it better than anyone.  I go back again and again.", "stars": 4}, {"text": "Okay, so hopefully you haven't been enjoying happy hour @ Riley's Pour House before you read this or you might not be able to follow the lilting Irish owners. \n\nTo recap: Murphy's Pour House from 1979-1985. Sullivan's Pour House from 1995-2002. Paddy's Pour House from 2002-2012. And, bagpipe please, Riley's Pour House opens March 1 of 2012. Still with me?\n\nIt's a tiny long bar just like the old Irish pubs. No more smoking allowed. Hurrah!!!  Same lousy service. \n\nMy guess is that the entire place needs (no, strike that .... demands) an automated food/beverage ticketing system. None of the cooks, bartenders, or waitresses know who ordered what nor what ticket belongs to which table. It's actually pretty funny if you're not a) hungry or b) thirsty. \n\nI really really want this place to do better. We need more Irish pubs and local old time watering holes. \n\nGet it together, Murphy's ... er, I mean Sullivan's....er, I mean Paddy's or is it Riley's? ;  ).  Whatever the case, they have cold Guinness. And Irish music.  And fun patrons.", "stars": 2}, {"text": "The delivery driver mistakenly rang my doorbell, having confused 133 and 113.\n\nRather than taking a step back and analyzing the situation, he begins to accuse my wife and I of ordering and refusing to pay for this pizza.\n\nThe driver then gets on his cell phone and rather than calling the number than was given when the order was placed, begins to call his bosses and starts threatening me with felony charges. \n\nSo I take the initiative and ask the fine upstanding gentleman what the phone number of the order-er was, phone my neighbor and discover the mistake. Rather than a thank you or a sorry, he just speeds off (breaking the speed limit on our block) to reach his destination 50 feet away.\n\nI would call to complain, but based on the other reviews, its clear the owners do not care about Carnegie or it's residents, and its pretty well known around town just how awful their food is, so it would be pointless to boycott a place I'd never order from again anyway.\n\nDo yourself a favor and order from ANY other establishment in town.", "stars": 1}, {"text": "3/6/12  visit -  i am from san francisco bay area and if u want a dive go to china town in san francisco. - this place was dirty like chinatown dive but some of the best food i have every tasted came from a dive. the food was really good and my group ordered a bunch of different things it was all good- a- taste.- prices are reasonable a-. --------they dont speak english very good and got my order wrong.\nsweet potatoe fries a+\npizza  - a\neggplant hoagie b+\ngreek salad b+\ngyro a+\nif they scrubbed the place down and the lady spoke better english 4 star ****", "stars": 3}, {"text": "Recommended. 16 inch pizza on special was cheap. Fast service. Not the best pizza but above average.", "stars": 4}, {"text": "Some of the worst pizza I've ever had.  We used a coupon from the paper for a 2 topping 8 cut Sicilian. First of all the pizza wasn't even cut through, and the sad attempt at cutting was so uneven that 4 of the slices were about an inch wide, while the others were about 4\" each. The toppings were scarce, they used mini pepperoni and put maybe 8 on the whole pizza. The onions were huge chunks and the mushrooms were straight from a can. The worst part though was the thick doughy crust that tasted more like a fishy sourdough roll. I'm serious... It was so noticeable that it made me wonder if the dough was bad or if they for some weird reason put fish sauce in it. It was gross. \n\nWe also ordered steak and Italian hoagies. The veggies were old and wilted, and there was no dressing on either. The Italian had deli meat that was clearly bottom of the line and not very generous. The \"steak\" (if you an call it that) was greyish instead of brown and looked like it was a processed meat chopped into pieces. No flavor or seasoning and the texture was reminiscent of spam. It was so bad that I only ate 1/4 of it and tossed the rest. \n\nI have ordered from here in the past and always been disappointed. I thought I would give them another try since I'd never ordered a Sicilian pizza from there. What a mistake. I will never order from them again!", "stars": 1}, {"text": "Having certain businesses with skill sets in your local neighborhood is important.  I try to keep it as local as possible, so when I heard about a tailor in Carnegie I was intrigued.  The building is in a strip mall across from Carnegie Coffee Company.  Unassuming, looks like it is closed all the time, until you do a drive by and see the hours posted.  There is a Latino man in his 20's working when you arrive.  In my mind, I imagine a tailor to be older, kind of like my grandfather maybe with measuring tape around his neck (Textbook movie tailor), so I was a bit trepidatious about dropping off my clothing.  He asks you to go change into a closet (Yes, a closet to change in with one lightbulb) BUT all my worries aside, the moment he started working on my items I knew he was the real deal. He learned from his father at the age of 14 how to sew. and he does things the correct way.  Meaning, for example-  I took in a pair of khakis all the way down to the cuff, but he seamed them up to look EXACTLY the way they were when I first bought them.  Most placed will have bulges and puckers.  The rest of my items were just as perfect.  Very inexpensive at $10 for a pair of pants to adjust the hem.  The items were done in a timely manner.  He takes his business very seriously.  While I was there, I watched a lady rush in and demand 6 shirts to be altered in an hour, and he did it and charged the same price.  Really nice guy, please go and support this business to keep him around town!", "stars": 4}, {"text": "New to area and decided to pay this shop a visit! It was definitely the best experience I've ever had with a tailor. He is MUCH cheaper than the other shops, he charges 10 while others charge $15, and he goes above and beyond for what he charges.\n\nI dropped off 4 jeans, and he hemmed and tapered the jeans! I couldn't even tell the difference between the store bought jeans and the quality of his work. It was absolutely perfect, no bulges or puckers! They the match the exact stitch as the factory. \n\nAbsolutely a great guy, they were all done and waiting for me as promised! I'll definitely be taking all of my business to this place, and would highly recommend to anyone who is looking for a personal tailor who actually cares about his work and building an honest business.", "stars": 5}, {"text": "I needed alterations done to my suit very quickly. Like three days quickly. Not only did Filberto at Alteration World have it ready, the price was beyond reasonable and the work was EXCELLENT! I plan on bringing all my clothes to him from now on.\n\nOh and he let me know that they also dry-clean. Wonderful shop!", "stars": 5}, {"text": "This is the best alteration place I have been to. The guy that owns it is extremely helpful and works FAST. Also, the prices are so reasonable I wonder how he stays in business. He was able to do an alteration on short notice and was very acommodating. The alteration I needed done--and fast--was right in the middle of prom season. All the other places I called gave me a several week wait, but he took me right away. I will be back!", "stars": 5}, {"text": "I just needed a broken zipper replaced on my favorite Penguins fleece jacket and a pair of suit pants hemmed.  The price was very reasonable and the work done was great.  I will go back for all my tailoring needs and highly recommend if you need any done.", "stars": 5}, {"text": "Are you are really looking at the review for LJS?  Its fried stuff, with extra fried stuff in a cardboard boat.  You will regret eating it 30 minutes after you finish, but it is delicious.", "stars": 3}, {"text": "I agree with Paul on this one. But I had to stop here on my way home from work tonight. \n(I think I feel my heart yelling at me again) , The gal at the drive thru window was just soooo sweet , I just might go back and ask her to marry me! \nBut then again , she gave me a slip with a survey on it to fill out online. \nMaybe she just wanted my positive response. Ok Sarah B. you got it ... now where's my free coke ?", "stars": 3}, {"text": "It's deep fried garbage....it's LOS c'mon what do you expect.....however I have never had better, friendlier service at a fast food restaurant.", "stars": 5}, {"text": "By far the worst most unprofessional dentist I have ever experienced her staff is too busy watching soap operas on all the TVs in each room instead of cleaning and she gave me a filling which was too deep which could have been understandable as her son had his pictures delivered from Hawaii and she had to stop 3 times to pay for them and show her whole staff all of them must be nice to have a 14 year old go to Hawaii on her moms dime and have her patience wait to see all of this happen I had to have oral surgery and have the tooth removed because she put the filling in too deep an abscessed tooth was the result I wouldn't recommend her to an ex girlfriend or someone I hate because of the three months of extreme tooth pain I had to deal with because of her lack of care and follow through even after I called and asked them for advice and follow up they simply could care less and did not even offer to reschedule an appointment other than prescribing me vicodin and antibiotics do not recommend and do not go to her license should be pulled!!", "stars": 1}, {"text": "When I moved to the area, Dr. Weinberg was recommended to me by my cousin who had been a client for years. I've had nothing but positive experiences with her and her staff since seeing her two years ago. The team is professional, nice and courteous. I recently had to reschedule an appointment due to a last minute work thing and they were very accommodating. My daughter looks forward to coming to the dentist so that's saying something. I DO wish they would turn off FOX news in the lobby as I'd rather watch paint dry but... nobody's perfect.", "stars": 4}, {"text": "In all fairness - I did not see this dentist but did schedule an appointment and waited 15 minutes for them to open.\n\nWhen I look at Yelp reviews, I usually weed out the outliers (the best and the worst).   Unfortunately, there are only two reviews.\n\nIt was my first time at the office.   The office admin (very nice) asked for me to come early (before 9am) to complete paperwork.   I arrived at 8:50.    I waited.   I watched 2 employees walk by me (unlocked the door and re-locked it).    They did not acknowledge me.\n\nThe door I was at had signage (open hours).    I decided to leave because of a review where the staff seemed distracted or disinterested in my presence.\n\nThe office admin (very nice) called me to inform I am missing my appointment.   I explained to her that there were too many indications where this was not going to be a good fit and wished her the best of luck.\n\nI recommend if you see this dentist you go to the front door (furthest away from the parking lot) for the entrance.\n\nPoor recommendation because the staff who walked by me seemed to be distracted which was pointed out in a previous review.", "stars": 1}, {"text": "This is by far the best dentist I have ever been to.  She is honest and never trys to sell you a bunch a stuff that you dont need. We are very great full that we discovered her. We adjust our vacations to make sure that we stop in to her office in Pennsylvania at least once a year for cleaning and check ups, worth the drive from Florida.", "stars": 5}, {"text": "I've been to this office a good amount of times.  Each time the receptionists give of a vibe of entitlement and it is very uncomfortable.  Dr. Weinberg herself is very nice, but I doubt her ability. Every procedure she has done to my teeth has backfired. The third and last issue I have is that i always paid cash at the end of my visits and somehow I have received an invoice for $55. I called and of course the receptionist was sassy and rude so I gave up. Will never go back or refer anyone else", "stars": 1}, {"text": "Don Don is a restaurant I find myself missing now and again, it's probably my favorite restaurant in Carnegie. Simple setup, just a small restaurant with a few tables and a TV. Oddly enough I think my favorite thing to eat there is the wonton soup, never had better. The food is average but I always enjoyed eating there, great service and a cheap place to get Chinese food.", "stars": 3}, {"text": "Take it from me; avoid this place at all cost.  The only time I go is when I am starved and don't have the energy to cook or get edible food.  And then after I have been kicking myself.", "stars": 1}, {"text": "Far away from real Chinese food. Doesn't even taste good as American style Chinese food.", "stars": 2}, {"text": "I used to order takeout here once every month or so. The food tastes average and the price is good. It's your typical low-end Chinese place. \n\nThe last (and final) time I ordered here I just so happened to be picking up my order while a health inspector from allegheny county health department was making his rounds. While I was waiting on my food (which took much longer than usual) the inspector was pointing out violations. He also requested a copy of a certificate that the man behind the register was unable to produce. The inspector looked at me like I was crazy for waiting on my food despite the obvious poor conditions.  \n\nAs for the rest of the place - it's always been kind of dirty inside. The carpets are just FILTHY and the walls match. There are always children's toys scattered about the floor because the owners children are always there, so be careful not to trip. \n\nThe workers do seem like nice people just trying to make a living but when it comes to cleanliness Don Don is lacking.", "stars": 2}, {"text": "Delicious Singapore noodles and seafood delight. Crispy flavorful crab Rangoon, and cold sesame noodles done well (but could've used a bit more sauce). Excellent real Chinese food, friendly service.  Restaurant ambience: high school cheap date quality.", "stars": 4}, {"text": "I came here with two friends prior to visiting Apis Meadery next door this past weekend.  I ordered the General Tso's chicken, and my friends ordered the sesame chicken, crab rangoon, and another appetizer (egg rolls?).  They ordered the combo with less meat, and I ordered the one with more--the names were very similar, which I found confusing. The food took quite a while to come up (~15 min.), so I'd suggest calling ahead if you're in a rush.  While we were waiting, the woman behind the counter yelled at someone over the phone in Chinese, and then at a guy who came in to pick up food for delivery (probably the same person).\n\nTo be honest, I'm not much of a fan of Americanized Chinese cuisine (I lived in Singapore for 3 mos. and have visited Hong King and Japan); it's been awhile since I've had it, and this dish reminded me why.  I don't care for the overbearing sweetness and thickness of the sauce, nor do I care for the pre-cut meat in the dishes (I like to cut up my own meat, thank you very much), so the flavors and textures don't do much for me.  Having said that, my friends claimed this was the best Americanized Chinese fare they'd had in PGH (and they live in Squirrel Hill!), so if you're a fan of this cuisine, you can take that into consideration.\n\nIf nothing else, this meal provided us with some much-needed food to absorb the alcohol from the mead, which I appreciated.", "stars": 3}, {"text": "All I can say is the worst! We were the only 2 people in the place for lunch, the place was freezing and loaded with kids toys! 2 bicycles, a scooter, and an electronic keyboard graced the dining room. A fish tank with filthy, slimy fingerprints smeared all over it is there for your enjoyment.\n\nOur food came... no water to drink, no tea, medium temperature food. Of course its cold, just like the room, I never took my jacket off! The plates are too small, you food spills over onto some semi-clean tables as you sit in your completely worn out booth seat. The fried noodles were out of a box and nasty, the shrimp was mushy, the fried rice was bright yellow.\n\nWe asked for water, they brought us 1 in a SOLO cup for 2 people. I asked for hot tea, they said 10 minutes. What Chinese restaurant does not have hot tea available upon request?\n\nOver all.... my first and last visit to this place. The only good point was that it was cheap, and deservingly so.", "stars": 1}, {"text": "We went on a weeknight.  Place was not busy waited over 20 minutes for drinks and to have our order taken.  We ordered an app and it came out with the meals and that was another 20 minutes or so.  Food was luke warm at best.  I would not go back.", "stars": 1}, {"text": "Went for breakfast on 6/16/14. We received very good service and meal came within a few minutes.Waitress could have smiled more but was friendly. \nI had a Grand Slam... it was more than enough food. \nMeal was very tasty... We will definitely go back. \nIt is a popular Denny's.", "stars": 4}, {"text": "I love their stakes and i come here every week just to get the t bone steak, it is completely delicious! \n\nGreat atmosphere, there is always a lot people and the waiters are nice; food portion is great as well!", "stars": 5}, {"text": "Perfect time with hubby, after work which is 4 am and you can still have a hot nice meal, waitress was such an adorable girl. Her arm was broken or smth but she still dis a great job!\nStrawberry lemonade was just smth i have been craving for for so long but did not know what it was :) \nStrawberry milkshake, nachos and t bone steak is smth we never stop ordering!\nIts always nice when u go late at night like us, it is not crowded, not noisy, nice music playing and always nice people around. \nIf you want smth quick and it is late at night then i would say Denny's!", "stars": 5}, {"text": "This location never disappoints!! Food is always consistently great, and if you come at the right time, (witching hours) you may see the cook singing and dancing along with the music in the back. And it is awesome! ! Love this place!!", "stars": 5}, {"text": "I belong to this gym...  I live in the South section of Pittsburgh, and I find that this gym is not too far from me.  The staff is friendly, the equipment is quite good.  You get two free personal training sessions when you join.  They have lots of weights (which my boyfriend uses) and a decent cardio room.  The only thing I would say is to increase some of the cardio equipment.  Water is only $1 a bottle!", "stars": 4}, {"text": "I bought a three month membership last year, mainly to attend the Silver Sneakers classes. I was in my early sixties and hadn't exercised in a while. I tried the evening classes but they were very crowded and difficult, so I tried a morning class for seniors. I like to stretch out before my class actually starts, so I went to the tail end of a yoga class. The women in this class were very nasty to me and told me that I wasn't welcome to stretch out in their class. I never went back thanks to the attitude of the other members. I didn't feel welcome here. I complained to the manager, who said that I was welcome to stretch out in whatever class I wanted to, but the hostility of these yoga students was very evident. Do they think that this is their private gym?", "stars": 2}, {"text": "I really like this gym. It is nice neighborhood gym and unlike big gyms they don't have big contracts and they have flexible memberships. Great selection of classes. All the instructors are very good knowledgable and motivating. All the staff working there are super nice. Their selection of the equipment is good too !!", "stars": 4}, {"text": "If you like being greeted in the morning by a gym worker slopping down eggs from a frying pany instead of working....this is your gym....complain to the manager and she gets nasty....try getting in touch with the owner....impossible!  Most unprofessional gym ever!!!!", "stars": 1}, {"text": "I brought my husband and my parents all to Papa J's last time my husband and I were in Pittsburgh. My parents are really picky about their italian food, usually they drive places in east bumf*@ (tarentum, ligonier...) to get their capital I-talian.\n\nMy pop is kinda grumbly, and getting him to try something new is like pulling teeth. The only reason I got him here was becuase they were on their way to drop us at the airport.\n\nWell, my dad goes back now regularly and that says a lot, considering he lives in Murrysville. \n\nThe first good sign Dad was happy was that he seemed impressed when it was open- it was noon a few days after Christmas. Second good sign was that Dad ordered wine, at it was only 1 pm. Dad, while not a teetotaler, rarely has a drink before 5 pm so I know he was anticipating a good meal. The kicker was that he was so happy he left our waitress a $20 tip on a $50 meal. \n\nCan I say, I live in Texas now and I still relive this afternoon back in December? I had chicken picatta...it was perfect. My dad had eggplant rollatini, my mom had a pizza, and my hubby had basic pasta and marinara. It all was amazing, delicous, and inexpensive. In Austin, you can't get a decent italian meal, much less a decent italian meal for under $50 for four people.\n\nI know there are so many good Italian places in Pittsburgh but I just think back so fondly on this day...when me Dad liked someplace I took him :)", "stars": 5}, {"text": "Papa J's is by far my favorite restaurant in Pittsburgh, my hometown.  I eat there almost every time I visit, and everything I've ever ordered has been fantastic.  Fresh ingredients, simple preparation, reasonable prices.  Also, they make the best pizza in town HANDS DOWN.", "stars": 5}, {"text": "This is one of my husband's fave restaurants in town. My husband generally orders Chicken Parm, which is very good. Their sauce is quite good. They serve fresh bread with a plate of olive oil and balsamic vinegar for dipping -- yum.\n\n I generally order one of their house salads (think it has a specific name, but can't recall off the top of my head) which has mixed greens and I get it with blue cheese, pine nuts and their yummy vinaigrette. A tad pricey for a salad that's just lettuce and cheese (I want to say about $8 with the extras), but really good. (Especially with some cracked black peeper.) I tend to follow this up with a smaller plate like their red pepper app or the greens & beans. \n\nThe place has sort of a rustic atmosphere and can be on the loud side. It has a comfortable feeling. It also has a solid wine by the glass selection -- better than a lot of places in the 'burgh. \n\nUnfortunately, we've never had dessert there b/c we get so full of bread and dinner!", "stars": 4}, {"text": "Thanks yelpers for this find. The service, the plating, the ambiance were wonderful. I had the eggplant parmigiana and it was good - but different. It was thinly sliced (like deli meat) and wasn't breaded, it was fried in a very light batter.", "stars": 4}, {"text": "This place has been a favorite for 20 years since we returned from a trip to Italy having several weeks of fabulous fresh food, and couldn't think of any place we wanted to eat. Papa J's measures up to our expectations with great salads, bead and wine. I'm partial to the eggplant rollatini and my husband likes samplers, ravioli, fish, white pizza. I like the space with exposed brick walls-there are knowledgeable servers. Sometimes it is a bit loud- more noticable when it is empty with a large table nearby. But don't get the wrong impression -it's a great place-consistantly great food.", "stars": 5}, {"text": "Great, authentic, classic Italian restaurant in one of the most unlikely places. \n\nI grew up eating here and make a visit nearly every time I come to town.\n\nTry the fried calamari \"Roman Style\" for a little kick!", "stars": 5}, {"text": "I've been to Papa J's twice and had mixed experiences.\n\nBoth times I had the banana pepper appetizer, which is great and goes really well with the FRESH and delicious bread and cheese they give you at the start of your meal.\n\nFor entrees, me and my girlfriend have had mixed experience.  I've had the fish sandwich (very good) and the eggplant parm sandwich (okay).  My girlfriend got the salad with bread and basil on it, but the basil was over powering and the bread was soggy with the dressing. \n\nThe service is also a mixed bag.  The first time our server went out of her way to take care of us and even MADE me cocktail sauce for my fish sandwich.  The second time, the server was lackluster, didn't know anything about the menu and wasn't able to take proper care of us.  \n\nI would return to Papa J's, but I my terrible experience last time isn't enough to say it would be my first pick of places to eat around Carnegie/Robinson.", "stars": 3}, {"text": "I went there for dinner last night with a client.  This is second time I visited.  I had a scotch and he had a Guiness.  The (-1) is for drink selection. Just stock some better beers and higher end scotch and you're five stars.\n\nWe started with the meatballs covered with Provolone and other blessed goodness.  These did not disappoint.  I had a four cheese pizza with sweet sausage and garlic.  It was fantastic.  They have so many good dishes, but I wanted the pizza last night.  I couldn't finish the pizza - way to go big medium pizza.\n\nI finished up with a coffee.  The parking can be a bit of a challenge on the street, but it's a small town atmosphere in Carnegie, PA.  I love the downtown there.", "stars": 4}, {"text": "What a wonderful surprise found in Carnegie PA, just south of Pittsburgh.  I was in town on business with a couple co-workers and after having a not so great meal the night before, we asked one of the locals for a recomendation.  They told us to try this little Italian place called Papa J's and boy did they send us to a great place.\n\nFirst off, when you walk up to the place, the front and side windows give you a fantastic open view into the kitchen from the outside.  You can stand outside and watch the chef making all the wonderful food and you can smell the fresh bread before you even walk in the door.\n\nI am not sure how long this place has been around but the kitchen looked well used, while the dining area as well as the bar looked very clean and modern, almost as if it had been freshly updated.  \n\nThe server was quick to welcome us and suggested several different items off the menu as his favorites when asked.  The three of us were very hungry and wanting to try a few different things, so we began with a Margherita pizza which was absolutely perfect.  They obviously make their own breads and dough for the pizza and I don't think this pizza could have tasted any better.  Then came bowls of Italian wedding soup which was pretty good.  Of everything there, this was the one item I probably could have done without.  Not that it was bad, but there was nothing particularly special about it.  \n\nWe also ordered the Garlic Rolls (not that the bread they already give you and the pizza was not enough carbs for 1 meal) and they were to die for.  Crunchy on the outside and warm and chewy inside, these things were a meal by themselves.  One of the guys with me said the pizza sauce would be good on them so he ordered a cup of the pizza sauce (which is fresh made there, not out of some can) and he was right.  As if these little killer bread balls with garlic were not good enough, dipped in the pizza sauce they were even that much better.  \n\nBy the time our meals came, we were all pretty full, but we pushed on and continued to eat.  I had the Veal Parmigiano which was tender and very good.  It came with a side of pasta which I tasted just to try and it was excelent as well.  Had I not been eating a weeks worth of carbs in one sitting with all the pre-meal stuff, I certainly would have finished it.  As it was, I ate most but not all of the generous portion of veal.  \n\nOne of my co-workers had the Chicken Picatta which he said was one of the best he had ever had and the other guy tried a pasta dish which he said was very good as well.  \n\nThey had a great wine selection as well at reasonable prices by the glass or bottle.\n\nOverall a fantastic experience with great food and atmosphere.  I don't really know how expensive the area is for food, but coming from the Chicagoland area, I fouknd this place to be pretty reasonable.  The three of us ate very very well for an average of aproximately $30 each not including alcahol.  Fantastic fresh food at a reasonable price, who could ask for more.\n\nMy only complaint is that I had to return to Chicago and I am now craving to return to Papa J's.  I hope work sends me out here again sometime soon!!!", "stars": 5}, {"text": "Yay, I'm a fan but sometimes service is a little slow, it was very good for us this visit.  Go to Papa j's every once in a while but mostly for the White Pizza.  It is the best white pizza I have ever had.  Order the white pizza on our visit this  weekend... it has garlic, spinach, feta cheese and we usually add some veggie on top.  It was delicious!  Order fried calamari and it was OK...note to self next time try the calamari roman style.\n\nLike the dinning room with the hardwood floors and bright lighting.  \n\nThe bar was jumping thou never go to the bar.", "stars": 4}, {"text": "Terrible service.  Food unremarkable.  Waiter disappeared for 45 minutes to serve larger group due to staffing mismanagement.  Saved his tip by discounting meal after I complained.  All and all, a very crude and unpleasant dining experience for me and my guests.  Not to be repeated, never again!", "stars": 1}, {"text": "Yay, I'm a fan of the white pizza.  Had take out.  \n\nThe bar was jumping when I picked up our order.\n\nThe white pizza is so delicious...with garlic, spinach, feta, and added some veggies.  Tried the Roman Style calamari, very good better than the fried calamari we had last time.", "stars": 4}, {"text": "We met our good friends from Morgantown here for lunch today and were really impressed with the place itself and the menu. \n\nI had read a few of the reviews ahead of time and the pizza was mentioned more than once so by the time we got there, I was jonesing for it. \n\nIt certainly delivered. The crust was great, the sauce wast too sweet and the toppings were sufficient. \n\nOur friend for the baby clams with oil and garlic over angel hair and let me try a bit - as good as the pizza was, this was _much_ better. \n\nWe'll return again to this beautifully lit gem in Carnegie PA soon!", "stars": 4}, {"text": "OK, its Friday night and have about 70 minutes to eat. Driving by Papa J's and W says, lets stop in and get a quick dinner. \n\nAdvice host that we are in a hurry.  The host advised us it is a 90 minute service. The place was crowded, we were seated at the last open table. However our waiter, Jason, said he will do his best to get as out on time. We ordered our dinner immediately, with a salad and a glass of wine. In a few minutes we had our wine, then in a few more seconds we had our salads and some great homemade Italian bread with some olive oil and balsamic ving. for dipping.  Yum!\n\nJust as we were finishing our salads our dinners were delivered. Great job Jason! The Fettuccine Carbanara was very good; a thick cream sauce with bacon and ricotta.  In and out in 60 minutes.  Now that is some good service.", "stars": 4}, {"text": "Great little gem! The food was fantastic was very food and just the right price. The Italian food was amazing, but you can not leave without a dessert and be prepared for giant serving. I had the carrot cake yummy!! Def a place everyone should try.", "stars": 4}, {"text": "I have to say that I write this review with much regret, because I have always loved PaPa J's. But my recent experience there has changed my mind a bit. \n\nFrom the minute we were seated, we were greeted by a server that was clearly inexperienced and didn't know the menu. As I said before, I've been to PaPa J's a good handful of times so I know the menu decently well, but the server couldn't explain any of the questions I had about a couple new dishes I was thinking about trying. I swear this guy must have just looked at the menu for the first time a few minutes ago.\n\nBut it wasn't just the knowledge of the menu. It was one thing after another with our server. My wife asked for a glass of water 4 times until she finally got it (at which point the meal was over, so we didn't care at that point).  I mean come on, for a restaurant of this calibre and price is it too much to ask for a glass of water? There was no one filling up water.\n\nMy biggest complaint, however, is what happened with our meals. My dad and I both ordered the trout special (trout with roasted red peppers and lump crabmeat). Instead, the meal that was delivered to both of us was trout with a heaping pile of spinach and mushrooms. Not what the special was at all.  And by the way, that item is on the menu as a regular item so whether or not the mistake was made by the server (which, we are sure it was) or the chef, who knows for certain. Not to mention, though, that a good server wouldn't have served us that regardless. \n\nBut before you think we had an unusal experience that was all due to a poor server, let me continue. When we informed our server of the mistake, he didn't really believe us until he checked his order sheet, and then he blamed the error on the chef. At this point, the meal had been sitting (because it took us forever to flag this guy down again) so the trout was basically cold. The server then said he would have the meals re-made. So, he took the meals back to the kitchen. Meanwhile, of course, my wife and mom are eating their meals and my dad and I are sitting there with no meals. Also keep in mind that my wife still had not gotten the water she had been asking for, and my iced tea had been refilled with a soda (yes, believe that or not). All the kitchen did was scrape their \"mistake\" off of our fish! They didn't remake anything. Our fish was served to us again with little pieces of spinach and mushrooms sticking all over it. Quite frankly, the fish wasn't good at all. I honestly would have rather had a fish sandwich from McDonald's that night. The server never did anything to try to make our experience better - he knew we weren't happy, but never offered anything such as dessert on the house. I'm not looking for a handout, but our experience was just plain awful that night. The guy never really even apologized for the mistake. Normally, I may have asked for a manager, but at this point I was ready to just get out of there (plus, we had to be somewhere else that night).\n\nMy opinion... for the money, there are many other restaurants I would rather eat at.", "stars": 2}, {"text": "This is a regular go-to for me. I love the food and the service. They always have the wine that I like and the food is always delicious. I suggest trying the flourless chocolate cake in the front of the store (in the section where you can buy stuff to take home). It is sublime and makes you want to go to a special cozy corner just to eat it and revel in its velvety loveliness.", "stars": 4}, {"text": "I thought the interiors were very nice.  We stopped here on a Friday night & I was glad they weren't busy because nothing else in the area looked appetizing.  \n\nMy daughter & I split a chicken parm sandwich, which was really good. Instead of it being served on a hoagie, it was served on thin bread- like focaccia or something.  It was pretty good- little messy.\n\nThe desserts looked amazing.  I thought it was pretty cool how you can watch the cooks prepare the food from outside.  The kitchen is situated on a corner with lots of windows.\n\nI would return.", "stars": 4}, {"text": "san francisco california visitor liked the food and the local is great. I am thinking about relocating to pttsbrgh area. I liked Carnegie because u can stroll down Main street and hit a couple places for lunch. I imagine this place would be crazy busy on friday or saturday night. we ate a lunchtime and it was nice.", "stars": 4}, {"text": "Coming here you get the feeling they haven't changed much.  The tables, the decorations, the menu.  All the same.  Does that make you a little worried?  Yes.\n\nI ordered the mushroom ravioli and it was... oily.  Very very oily.  The actual ravioli was okay, enough mushrooms.  but it was oily.  Did I mention that?  \n\nAmbiance, like I said, left much to be desired.  I don't think I'd have this place on my list of \"musts\" for downtown.  Much better restaurants to visit!", "stars": 2}, {"text": "Had dinner at Papa J's with a group of 6.  I loved how the restaurant is in a old brick building with large windows. It felt like a neighborhood restaurant. On a Saturday night, the restaurant was full but not crowded.  We were seated in a room with poor acoustics.  It was difficult to hear people at our table and the waitress.  While she tried, I can see the asperation in her face when she had to repeat the specials to both sides of the table.\n\nPeople ordered bourbon on the rocks before dinner which seemed watered down, while my lemon drop was made nice.  The bread was delicious!  Can you describe it to be creamy?  The fried zucchini was lightly breaded and not too oily.  It was a large portion made up of 2 sliced zucchinis.\n\nWe ordered a variety of dishes.  The pasta dish was dry with more pasta than sauce or meat.  Those who ordered the fish special thought it was delicious.  The shrimp dish was enjoyed as well.  I had the chicken marsala which was pretty good.  The marsala sauce wasn't too thick, and the chicken moist.\n\nHard to tell if the deserts were \"homemade.\"  The tiramisu and spumoni were small in portion and meant for one. \n\nOn the whole, I was on the fence with my overall impression of Papa J's.  \"A-ok\" probably is the best way to describe it.", "stars": 3}, {"text": "Service in this place is poor because of lack of acknowledgment since people working there are \"just\" working . They have nice decor,nice bar and good bread. Consider where this place is ,the prices are really really high . Nothing is served on the side with main dishes ....", "stars": 2}, {"text": "Terrible service...terrible food...this place smells like rotten wet wood", "stars": 1}, {"text": "Great place for dinner, drinks or a small celebration.\n\nPapa J's is one of my favorite go to places for dinner when we don't have reservations and want a nice dinner out. My husband and I have eatten here upwards of 20 times over the last few years and have never been disappointed. I assumed that when they opened the alternate bar with lounge area and extra tables for dining on the other side of the resturant that  the overall vibe of the restaurant would change and it would be very busy. I have been proved wrong.  We are always able to walk in on a weekend and get a table within a few minutes. Unfortunately, the alternate bar/lounge area isn't always open. I really don't understand why more people don't go here. \nMy favorites are the fried zucchini, wedding soup and pizza.The zucchini is always crispy and seasoned well. The wedding soup has big chunks of carrots and celery. My husband also enjoys the pork entrees especially the grilled pork and the pastas including the tomato cream sauce. Also, their homemade italian bread with oil and vinegar to dip is a great way to wet your appetite. Make sure to add the parmesan cheese that they put on the table. \n\nAlso, if you are looking for a good place to host a birthday party or event, consider Papa Js. They have a great catering menu and are easily able to accomodate larger parties. We had our rehersal dinner for our wedding here and everyone loved the food.", "stars": 4}, {"text": "Although the first impression through the door is charming and the aroma enticing  as you enter this restaurant- much can be improved upon for the prices asked for the dining experience. Our group of 7 had called a week ahead and were seated in the back of the far dining room, right by a door where clinking pots /pans and  dishes were heard throughout our meal, as well as a Darth Vader type noise coming from the ceiling vent. Our waitress was not knowledgable of all menu items, and three of our  very simple requests did not come out as ordered. ( dressing on the side of a salad,  less feta on an entree and no oil on another entree) The waitress blamed it on the cook, but did offer to get one entree changed. Also we were asked if we wanted pine nuts, feta or Gorgonzola on our salad and then were charged 2.00 extra per item in addition to the salad price (6.99) which brought the salad up to 10.99 ! Outrageous !\nThere is so much possibility for ambiance in this restaurant , but they miss the mark on service and atmosphere. I will most likely not return. Very overpriced for the quality and service.", "stars": 2}, {"text": "Papa J's is expensive and inconsistent.  The ambiance is nice but it doesn't justify the prices.  There are better restaurants in Carnegie.", "stars": 2}, {"text": "Very good restaurant with very good food at a pretty reasonable price.  We had a birthday dinner here with seven girlfriends. The waitress was very efficient , but not very friendly. Our orders came out hot and excellently prepared!  Try the tilapia milanese , it's excellent. Best steamed broccoli Iv'e ever had.", "stars": 4}, {"text": "I was pleasantly surprised by this restaurant.  Came here with no expectations.  \n\nI was greeted by a large open (garage style) window, that opened the whole lounge bar area to the street.  It had modern furnishings and the staff were quite friendly.\n\nOrdered the quattro formaggi pizza.  Quite good!!!  Great balance of cheeses.  Not too rich at all.  Crust was excellent too.  Can't wait to come back.", "stars": 4}, {"text": "Just to start off, we were a party of 12, which is always a little difficult.  We were celebrating 2 birthdays.\n\nWe LOVED the food, it was delicious. My husband got a chicken parm sandwich, which is served on a yummy flat bread, and I got the chicken basil pizza ( i got an 8 cut and several ppl tried it) we all LOVED it! It was stunning.  It was made with a very delicious crust, nice and crisp, not soggy (like pesto pizza can get)\n\nThe one waitress we had JASMINE, was fantastic!  She was bright, friendly and very knowledgeable about the menu.  She took extra time with the older ladies in our group to help them with their selections... \n\nNow... the other waitress.. Mary something was so incompetent...  She was awful and rude.  She missed 2 people on that side of the table failed to take their order and when we said something she said 'well they didn't speak up!' Ugh.  Then when it was time to sing and cut the cake, my sister in law said 'oh hey can you get the cake so we can sing?'  She came back, cut the cake (all crazy with some huge pieces and some super small pieces like she never in her life cut a sheet cake) and we didn't even sing!  We were mad!!\n\nThe place is so pretty, they have a new addition that was just built within the last 2 years (according to my father in law) and its really nice.  They look to have a cool bar area with some modern couches and a really sweet look.   \n\nSo good food, great looking place.. one bad waitress. Prices are about middle of the road for an authentic Italian place, nothing crazy.  All in all, we'd like to go back again, but we want Jasmine!", "stars": 4}, {"text": "I am amazed that people can write negative reviews about Papa J's.   I have been a return customer since the early 90's and the food quality, and service, are way above average......and especially for this price range.\n\nKudos to management for maintaining such a level of quality and freshness.   Nothing we had tonight was disappointing, and we over-ordered because each dish was delectable.\n\nThe best item tonight was the Mozzarella appetizer \"cradled\" in Bread with an authentic marinara.\n\nThe white pizza with sun-dried tomatoes was, as usual, out of this world good.   The scallops special appetizer was phenomenal.\n\nWE WILL BE BACK.", "stars": 4}, {"text": "Absolutely Awful Service.  Went to Papa J's awhile ago and the service was bad - the waiter was surly, rude and unhelpful..  Decided to try it again since it is close to Stage 62.  Big mistake.  Greeted by a dour manager that seemed mad that we had a reservation. 30 minutes to get a glass of wine.  At one hour and 45 minutes complained to the manager that we still had not received out entrees.  He said 'What do you want me to do about it?\" and said they had a busy night.  This is when tables around us sat empty. I then had to go back to the manager to give us our bill so we could get away from this ruined evening.  The bill was prepared incorrectly. If you want average food and terrible service, this is your place.  We will never go back.", "stars": 1}, {"text": "The menu has lots of choices and the food is great! The Resturante has been expanded so it's pretty large. The new section has door that they leave open during nice weather which makes for a nice ambience! The bread is great and fresh baked daily!", "stars": 4}, {"text": "I have been to this restaurant twice and was disappointed both times. I won't go back. The first time we were there almost 3 hours. It took forever to order and then forever for our food to come and the place was empty. When I complained the manager was very rude and tried to blame us for taking to long to order. It made no sense, how could we order when the waitress wasn't coming to the table? After arguing with me he ended up taking $6 off of our $200+ bill. Ridiculous. If it were up to me I would have never returned. Unfortunately my family decided to go here again tonight. Again it took a long time to get our food. My food was cold and bland, my kids food was cold. My husbands salmon was burnt to a crisp and my sister in law took one bite of her trout and refused to eat any more because she claims it was so disgusting. The wedding soup and bread were good, but that's it! My drink sat empty throughout my meal and never got refilled even when I asked. Bad food, slow service and rude managers. I'll pass on this place if my family decides to go again. Not worth it at all with all the other good Italian options around.", "stars": 1}, {"text": "Delicious!  Everything I've ever had here was great!  The white pizza is a MUST!  Always amazing!  I'm also a big fan of the chicken piccatta.  The bread that they bring to the table is delicious too!  They have a wide variety of selections on the menu and they also have nightly specials that always sound great!  Their prices are also reasonable.  Overall, I highly recommend this place!", "stars": 5}, {"text": "2nd times a charm. This place was 3.5 starts the first time I came, but stepped up large tonight.  Waitress was righteous and very fun.  Food was all excellent.  Caesar salad tasty--got with tomatoes big $ on that, fettuccini carbornara with bacon n smoky cream flavor.  Can't wait for the leftovers!!  The white pizza is that star though.  The crust/dough is heavenly and the flavor is top shelf.  I don't throw those accolades out easily, especially on pie, but this joint serves it up.  Good vibe, great service, phenomenal food.  Ill be back.", "stars": 5}, {"text": "Service was great. Apps delish, specifically the stuffed banana peppers & lentil with ham soup. I think I chose the wrong entree though because I ordered a cod with crabmeat special. The cod was completely tasteless with some crabmeat layed across the top. It all reminded me of boiled fish. Yuck! Note to self. Order the pasta!", "stars": 3}, {"text": "I love this place! The food is always so fresh and delicious. The staff is always friendly, as well.", "stars": 5}, {"text": "spinach/feta cheese salad:  B-\npesto alfredo penne :  :A+\nCoconut Cake huge piece:  A+\nbread small portions:  B\nService B \nhost seemed grumpy, waitress good, but then she got busy .\nPRICE: Pasta was $15 and the portion smallish more like a $12.99 dish \nARRIVE EARLY ON SATURDAY NIGHT THIS PLACE PACKED after 6pm", "stars": 4}, {"text": "It was just what we were looking for. The service was great. My husband had the veal sausage on green pepper appetizer in the larger size. It was great (spicy) and enough for a meal. I had the stuffed eggplant. That was very good but the sauce could have been a bit heartier. I would definitely go back. Really nice atmosphere and free parking in the back.", "stars": 5}, {"text": "We stopped at Papa J's last Friday night (8/1) for a round of drinks. There were 7 of us altogether and we had eaten at another restaurant earlier in the evening.  One member of our party walked up to the bar to let them know we were sitting on the couches along the wall, as it was fairly busy that night. In the short time that he was there, a man who was behind the bar looked at him and then turn away without saying a word or notifying anyone else. He then turned to a waitress who had approached the service area of the bar and asked her if  we could have a server take our drink order. She said \"yep\" and then abruptly turned and walked away. At that point, he asked to see the manager  who came a few minutes later. When my friend told him of what had occurred, the manager said \"What do you want me to do\"?\n\nMy friend said \"An apology would be a good start\" whereupon the manager looked back at him and said \"Get out and don't come back\" ???????? Are you kidding????\n\nMy friend is well traveled and frequently stays at higher end hotels and dines at quality restaurants. He was not screaming or belligerent in any way, shape, or form; simply informing the manager of what had occurred. \n\nThat being said, we left and went back to 131 East, where we had previously eaten. The service there was fabulous, as was the meal and the drinks creative and exquisite.\n\nThere are new restaurants that have opened in Carnegie as of late. Papa J's is no longer the only game in town.  Obviously this is the way a simple complaint is handled by management. Appalling!!  Do yourself a favor and frequent any of the other restaurants that are within walking distance of Papa J's. They understand the concept of  customer service.", "stars": 1}, {"text": "Some of the best chow around--love this place. The bread and salads and soups are great.", "stars": 5}, {"text": "Finally, great Tuscan-style Italian food in Pittsburgh, not that tasteless stuff that locals think is Italian.\n\nThe bread was warm and fresh. The bolognese sauce was creamy and rich, and unlike most restaurants was made with veal. I love the fresh smell of baking bread throughout the restaurant.\n\nI'm looking forward to working my way through the menu of chicken options, and next time, I'm saving room for dessert! The display of cakes and pastries at the door was amazing.", "stars": 5}, {"text": "Man has this place gone down hill.  My husband and I went a couple of weeks ago.  We had salads and pasta.  Both were on the verge of inedible.  With a single glass of wine, I felt downright robbed at the $50 price tag.  Seriously, I could have easily made what we had with jarred sauce and boxed pasta at home. Classico is better.  And the service was pretty absent to make it even worse... seemed she knew it was terrible and didn't want to deal with it.  Seriously, I'd rather eat at the OG.", "stars": 2}, {"text": "Food was NOT GOOD at all! My husband & I ate here a couple weeks ago for the first time. I ordered a salad & basil pesto cream pasta & my husband ordered the spinach & feta pasta. The salad was just a huge plate of spring mix (nothing else in it) with WAY to much vinegar dressing. My lettuce was drowning in the vinegar. My pesto pasta had no flavor (did not taste like a cream sauce to me) & the pesto was so runny/watery & way too much sauce not enough noodles. My husband's pasta had even less flavor than mine. We ate about a quarter of the food & couldn't even finish it. We took it home & it was so bad I didn't even eat my leftovers. And I hate wasting food!! Plus the prices are expensive for the amount of food you get & of course the poor quality. Don't waste your time eating here. There are much better Italian restaurants in Pittsburgh.", "stars": 1}, {"text": "Talk about overpriced. $18 for a fairly basic pasta with some obviously frozen chicken chopped up over it. The latter was terrible, thin and flabby and rather unappealing. The pasta itself was ok, as was the sauce. The desserts are pretty good. But honestly, that is a $10 dish whose price has been inflated.", "stars": 3}, {"text": "I'm up in the air about how I feel regarding Emmert Dental. Being that it is located in Market Square can be both a good or bad thing. Parking is scarce not to mention you have to pay for it yet you have great restaurants and coffee places around you. The office itself is old and raggedy looking but the staff are young and hip. I think possibly a little too young and hip. My dentist knew what she was doing but I didn't adore her. I'm still working out my bill because they charged me too much on my copay and don't really seem to have all their info. together. After a cleaning and fillings, I think I'm going to look for somewhere else to get my future dental work done...", "stars": 3}, {"text": "I've decided where I stand with Emmert Dental. They are unprofessional, rude and have no clue what they're doing (behind the desk). I will not be going back nor will I have nice things to say about them.", "stars": 1}]